[
  {
    "title": "CMA proposes price caps on vet prescriptions",
    "description": "The Competition and Markets Authority (CMA) has proposed the introduction of price caps on prescriptions provided by vets stating that pet owners could be “paying twice as much for commonly prescribed medicines from vet practices than they could pay online”. The watchdog believes that vets should have a prescription fee cap of £16 and should …",
    "url": "https://www.petgazette.biz/224642-cma-proposes-price-caps-on-vet-prescriptions/",
    "date": "2025-10-15T14:43:00+00:00",
    "source_section": "Pet Gazette",
    "sponsors": [],
    "_feed_full_text": "The Competition and Markets Authority (CMA) has proposed the introduction of price caps on prescriptions provided by vets stating that pet owners could be “paying twice as much for commonly prescribed medicines from vet practices than they could pay online”.\n\nThe watchdog believes that vets should have a prescription fee cap of £16 and should be required to tell customers about savings they could make by buying medicines online.\n\nThe CMA has also proposed that vet businesses should have to publish comprehensive price lists, make it easier for pet owners to access cheaper medicines online, give clear price information to owners arranging a cremation and give owners clear price information when they are choosing a treatment, with prices in writing for treatments over £500 and itemised bills.\n\nMartin Coleman, chair of the inquiry group, said: “Pet owners are often left in the dark, not knowing whether their practice is independent or part of a chain or what a fair price looks like. They are sometimes committing to expensive treatment without understanding the price in advance. And they do not always feel confident asking for a prescription or buying medicine online – even when it could save them hundreds of pounds.\n\n“Even where pet owners could access some of this information, it is difficult for them to compare prices and services – despite the fact that, in most of the country, there are several local practices they could choose between.”\n\nThe British Veterinary Association (BVA) said there were “positives” in the CMA’s provisional decision but that it “had concerns that some of the measures outlined will impact how services are delivered”.\n\nDr. Rob Williams, BVA president, added: “At first glance, there’s lots of positives in the CMA’s provisional decision that both vets and pet owners will welcome, including greater transparency of pricing and practice ownership; reform of the outdated regulatory framework; and support for our calls for regulation of vet businesses. The CMA also recognises that vets and vet teams are highly professional, and ‘work hard, act ethically, and put animal welfare first.\n\n“However, we do have concerns that some of the measures outlined will impact how services are delivered. In particular, we need clarity on the proposed introduction of comprehensive price lists, because how vet care is delivered is varied and complex and unless the CMA gets this right, it could end up creating greater confusion for consumers, which in turn could have a negative impact on animal welfare.”\n\nInvestment bank Peel Hunt has said the CMA’s “bark is worse than its bite” calling headlines around the proposals “clickbait”. It believes that the changes are minor, with the CMA having “retreated from most of its initial findings” while dropping plans to regulate or limit pricing.\n\nAs a result the company has recommended investors buy stock in CVS group saying: “The CMA enquiry has lasted over two years and impacted vets and the level of investment. We believe it will be positive for the industry and CVS Group to be able to get back to running the business rather than being restrained by regulation and bureaucracy.”",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 4
  },
  {
    "title": "Retail sales edge up 2.3% in September as food spending drives growth",
    "description": "UK total retail sales rose by 2.3% year on year in September, up from growth of 2% in September 2024 and above the 12-month average increase of 2.1%, according to the British Retail Consortium (BRC). Food sales increased by 4.3% on the year, compared with 2.3% growth in September 2024 and above the 12-month average …",
    "url": "https://www.petgazette.biz/224637-retail-sales-edge-up-2-3-in-september-as-food-spending-drives-growth/",
    "date": "2025-10-14T15:31:00+00:00",
    "source_section": "Pet Gazette",
    "sponsors": [],
    "_feed_full_text": "UK total retail sales rose by 2.3% year on year in September, up from growth of 2% in September 2024 and above the 12-month average increase of 2.1%, according to the British Retail Consortium (BRC).\n\nFood sales increased by 4.3% on the year, compared with 2.3% growth in September 2024 and above the 12-month average of 3.4%. Non-food sales rose by 0.7%, below both the 1.7% growth recorded a year earlier and the 12-month average of 0.9%.\n\nIn-store non-food sales were up 0.5% on the year, against growth of 0.8% in September 2024, and ahead of the 12-month average of 0.4%. Online non-food sales increased by 1%, down from 3.4% a year earlier and below the 12-month average of 1.8%.\n\nThe online penetration rate – the share of non-food items bought online – rose to 37.6% in September from 37.2% in September 2024, slightly above the 12-month average of 37%.\n\nBritish Retail Consortium chief executive Helen Dickinson said: “With the Budget looming large, and households facing higher bills, retail spending rose more slowly than in recent months. Milder weather meant shoppers delayed refreshing autumn and winter wardrobes and growth in food sales was largely inflationary rather than volume growth. Meanwhile, electrical sales were buzzing thanks to the release of the new iPhone and Apple Watch.\n\n“Rising inflation and a potentially taxing Budget is weighing on the minds of many households planning their Christmas spending. Retailers also face difficult decisions about investment and hiring over the golden quarter given uncertainty over business rates bills arriving in April. The future of many large anchor stores and thousands of jobs remains in jeopardy while the Treasury keeps the risk of a new business rates surtax on the table. By exempting these shops when the Budget announcements are made, the Chancellor can reduce the inflationary pressures hammering businesses and households alike.”\n\nLinda Ellett, UK head of consumer, retail and leisure at KPMG , added: “Overall sales grew in September, driven largely by household goods and increased mobile phone sales, as prominent brands launched new models. However, non-food sales are only growing by around 1.2% on average, indicating that spending continues to be very targeted as consumers remain cautious.\n\n“As we enter the golden quarter for the sector, retailers are planning product ranges and promotions to try and increase that rate of sales growth. They are also mindful that the Budget is beginning to move into view, with related detail about business rates reform and a general need for a boost to consumer confidence.”",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 3
  },
  {
    "title": "The Pack launches ‘UK’s first’ microbial protein dog treats",
    "description": "British plant-based pet food brand The Pack has partnered with German biotechnology company MicroHarvest to launch Gut Bites, a new range of dog treats made with microbial protein. Described as the first product of its kind in the UK, Gut Bites combine MicroHarvest’s proprietary protein ingredient with The Pack’s allergy-friendly, oven-baked recipe. The treats are …",
    "url": "https://www.petgazette.biz/224633-the-pack-launches-uks-first-microbial-protein-dog-treats/",
    "date": "2025-10-13T15:41:56+00:00",
    "source_section": "Pet Gazette",
    "sponsors": [],
    "_feed_full_text": "British plant-based pet food brand The Pack has partnered with German biotechnology company MicroHarvest to launch Gut Bites, a new range of dog treats made with microbial protein.\n\nDescribed as the first product of its kind in the UK, Gut Bites combine MicroHarvest’s proprietary protein ingredient with The Pack’s allergy-friendly, oven-baked recipe. The treats are formulated to be gut-friendly and suitable for dogs with sensitivities, intolerances or selective appetites.\n\nThe companies said the collaboration offers one of the first chances for UK pet owners to buy products containing microbial protein, an emerging ingredient produced through fermentation technology.\n\nDamien Clarkson, managing director of Prefera Pet Food UK , which operates The Pack, said: “Our community of dog owners often tells us they struggle with picky eaters and pets with allergies or sensitive stomachs. Gut Bites is our answer: a delicious, functional treat that’s also allergy-friendly. This launch demonstrates our commitment to bringing UK pet parents products that are innovative, healthy and sustainable.”\n\nMicroHarvest chief executive Katelijne Bekers said the partnership marked a major step in the company’s expansion: “By working with The Pack, we’re showing that microbial protein isn’t just a sustainable solution, but one that dogs truly enjoy. Gut Bites is a perfect example of that.”\n\nResearch conducted in partnership with Wageningen University in 2024 found that more than three-quarters of UK and German dog owners would consider buying pet food made with microbial protein. Palatability tests showed that even selective dogs preferred food containing MicroHarvest’s ingredient, eating 44% more on average than standard kibble.\n\nMicroHarvest said its protein is produced from agricultural side-streams through fermentation, requiring no farmland, pesticides or fertilisers. The company claims the process has a carbon footprint more than 90% lower than beef and significantly below that of plant-based proteins.\n\nThe partnership follows MicroHarvest’s 2024 collaboration with German brand Vegdog, whose Pure Bites became the first European dog snack to include microbial protein. With Gut Bites, the company said the UK would join Germany as an early market for its fermentation-based ingredient.",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 4
  },
  {
    "title": "PetFellas launches to support brand-led growth in UK pet market",
    "description": "A new distribution business, the PetFellas, has launched in the UK to support emerging and challenger brands in the pet sector. The venture, led by director Gerard O’Mahony, aims to offer what it calls a “brand-led” model of distribution designed to boost awareness and availability for smaller pet brands. It is backed by the FoodFellas, …",
    "url": "https://www.petgazette.biz/224628-petfellas-launches-to-support-brand-led-growth-in-uk-pet-market/",
    "date": "2025-10-10T14:36:32+00:00",
    "source_section": "Pet Gazette",
    "sponsors": [],
    "_feed_full_text": "A new distribution business, the PetFellas, has launched in the UK to support emerging and challenger brands in the pet sector.\n\nThe venture, led by director Gerard O’Mahony, aims to offer what it calls a “brand-led” model of distribution designed to boost awareness and availability for smaller pet brands. It is backed by the FoodFellas, a long-established food importer and distributor serving the UK and Ireland foodservice market.\n\nO’Mahony, who has more than six years’ experience in the pet industry, said the new platform would combine “passion for pets and professionalism in business” through a selective approach to brand partnerships.\n\nHe said: “We’re building something different, giving brands the platform they deserve and retailers the support they need. The PetFellas sets itself apart from the traditional wholesaler model, where we want to build brands, tell their story and focus on getting them into consumers’ hands through our retail partners.”\n\nGraham Hillier, managing director of the FoodFellas, said the venture drew on the company’s experience in foodservice. He added: “This venture brings the same energy, innovation and partnership focus that have driven our success in foodservice, and we’re excited to help redefine how pet brands grow and thrive in the UK market.”\n\nThe PetFellas’ operational base includes a logistics hub and integrated digital platform for omnichannel distribution. It plans to introduce its first range of brands in the coming months, beginning with Earth Animal – a US-based producer of all-natural pet food, chews and wellness products – for which it will become exclusive UK distributor following a transition phase.\n\nThe PetFellas team includes pet industry specialists and more than 40 staff across marketing, supply chain and customer service. Alongside O’Mahony, Chris Simmons serves as head of pet.\n\nThe company plans to expand its portfolio over the next three years, including through new partnerships, own-brand manufacturing and acquisitions. It aims to establish a small number of long-term, non-competing brand relationships with both manufacturers and specialist pet retailers.",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 3
  },
  {
    "title": "Nutravet launches Nutramed antibacterial gel and spray",
    "description": "Animal health company Nutravet has launched Nutramed, a hypochlorous gel and spray formulated to clean minor wounds and support the natural healing process in animals. The new product aims to kill more than 99% of known bacteria, fungal spores and viruses.  It is suitable for use on all animals, including dogs, cats and horses, and …",
    "url": "https://www.petgazette.biz/224625-nutravet-launches-nutramed-antibacterial-gel-and-spray/",
    "date": "2025-10-10T14:22:48+00:00",
    "source_section": "Pet Gazette",
    "sponsors": [],
    "_feed_full_text": "Animal health company Nutravet has launched Nutramed, a hypochlorous gel and spray formulated to clean minor wounds and support the natural healing process in animals.\n\nThe new product aims to kill more than 99% of known bacteria, fungal spores and viruses. \n\nIt is suitable for use on all animals, including dogs, cats and horses, and gentle enough for sensitive skin and delicate areas such as around the eyes and mouth.\n\nPackaged in a UV-protective bottle to maintain stability, Nutramed is intended for everyday veterinary and pet owner use to clean cuts, abrasions and minor injuries.\n\nNutramed is now available for authorised stockists to order. \n\nLianne O’Boyle, registered veterinary nurse and clinical lead at Nutravet, said: “Veterinary professionals need a reliable, safe and effective solution for minor wound management. Nutramed combines strong antimicrobial protection with a gentle formulation, making it a valuable addition to any practice or pet owner’s first aid kit.”",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 3
  },
  {
    "title": "Burgess Pet Care extends Excel range across Scandinavia",
    "description": "Yorkshire-based small animal specialist Burgess Pet Care has expanded its distribution partnership with FS Petcare AB to make its Excel range available across Denmark, Sweden, Finland and Norway. FS Petcare AB, a distributor of pet products in Scandinavia, already represents Burgess in Sweden. The extended agreement will see the company handle a wider selection of …",
    "url": "https://www.petgazette.biz/224621-burgess-pet-care-extends-excel-range-across-scandinavia/",
    "date": "2025-10-09T14:33:55+00:00",
    "source_section": "Pet Gazette",
    "sponsors": [],
    "_feed_full_text": "Yorkshire-based small animal specialist Burgess Pet Care has expanded its distribution partnership with FS Petcare AB to make its Excel range available across Denmark, Sweden, Finland and Norway.\n\nFS Petcare AB, a distributor of pet products in Scandinavia, already represents Burgess in Sweden. The extended agreement will see the company handle a wider selection of Excel products throughout the region, including recent product developments.\n\nEstablished more than 25 years ago, the Excel range was among the first premium food lines for small animals. Developed by vets and nutritionists, it includes feeds for rabbits, guinea pigs, rats, ferrets and chinchillas, formulated to provide balanced nutrition with essential vitamins and minerals.\n\nThe full portfolio – including Excel Long Stem Feeding Hay, Excel Dandelion and Marigold Feeding Hay, and Excel Nature Snacks – is being rolled out through retailers and veterinary practices across Scandinavia. The first phase of distribution has already begun.\n\nManaging director Mark Womersley said the partnership reflected growing demand for small animal products in the global pet market. He said: “Combining Burgess’ science-backed nutrition with FS Petcare AB’s local expertise and extensive retail network allows us to expand access to our high-quality feeding hay and carefully formulated nutrition.\n\n“With training from Burgess’ nutritional experts and close collaboration with the Excel marketing team, FS Petcare AB is equipped to provide practical support, helping drive real improvements in small animal health and wellbeing throughout Scandinavia.”\n\nThe move forms part of Burgess’s wider international strategy to strengthen its presence in key markets, increase brand recognition and deliver consistent service worldwide.\n\nSheila Nguyen Lind, FS Petcare AB chief executive, said the company was committed to investing in the Excel brand’s growth. She said: “We’re incredibly excited to bring Excel closer to the whole Scandinavian retail network. We’re not just distributing the brand, we’re investing in its growth.\n\n“We want to support our retail partners in delivering the highest standards for their customers and pets. By drawing on Burgess’ specialist expertise, this partnership addresses gaps in small animal nutrition and enables retailers to provide research-backed guidance for pet care.”\n\nThe partnership marks a step in Burgess Pet Care’s expansion across the Nordic region, enhancing product availability and reinforcing its long-term international growth strategy.",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 3
  },
  {
    "title": "Pawer Water signs UK distribution deal with We.Pet",
    "description": "Pawer Water has secured a UK-wide distribution agreement with specialist pet trade supplier We.Pet. The deal will see Pawer Water’s supplement range distributed through We.Pet’s network of independent pet retailers across the country.  The products use a nano-powder hydration system designed to achieve higher nutrient absorption rates than conventional supplements. Founded by Nathalie Ohana, Pawer …",
    "url": "https://www.petgazette.biz/224616-pawer-water-signs-uk-distribution-deal-with-we-pet/",
    "date": "2025-10-09T14:12:35+00:00",
    "source_section": "Pet Gazette",
    "sponsors": [],
    "_feed_full_text": "Pawer Water has secured a UK-wide distribution agreement with specialist pet trade supplier We.Pet.\n\nThe deal will see Pawer Water’s supplement range distributed through We.Pet’s network of independent pet retailers across the country. \n\nThe products use a nano-powder hydration system designed to achieve higher nutrient absorption rates than conventional supplements.\n\nFounded by Nathalie Ohana, Pawer Water has grown rapidly since launch, developing science-led formulations focused on preventive canine health. \n\nAccording to the group, the partnership marks a key step in widening access to independent stores, which remain central to pet owner advice and education.\n\nWe.Pet, which supplies premium and emerging brands to the independent pet sector, stated that the addition of Pawer Water strengthens its range in the growing functional supplement category.\n\nOhana said: “We are excited to partner with We.Pet, whose commitment to supporting independent retailers matches our mission to bring better wellness solutions to dogs and their owners. This collaboration will allow us to reach more communities across the UK and further our goal of making preventive care simple, effective and accessible.”",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 3
  },
  {
    "title": "Joint health tops dog supplement demand in the US",
    "description": "The American Pet Products Association’s (APPA) 2025 Dog & Cat Report revealed a significant increase in overall supplement use among dog owners, with 53% giving supplements in 2024, up from 34% the previous year. According to the data, joint health and mobility supplements were the most popular among dog owners in the US, increasing to […]",
    "url": "https://globalpetindustry.com/news/joint-health-tops-dog-supplement-demand-in-the-us/",
    "date": "2025-10-16T09:09:54+00:00",
    "source_section": "Global Pet Industry",
    "sponsors": [],
    "_feed_full_text": "The American Pet Products Association’s (APPA) 2025 Dog & Cat Report revealed a significant increase in overall supplement use among dog owners, with 53% giving supplements in 2024, up from 34% the previous year.\n\nAccording to the data, joint health and mobility supplements were the most popular among dog owners in the US, increasing to 43% in 2024 from approximately 40% the previous year. Since 2018, demand for joint health supplements has remained relatively steady.\n\nMultivitamins showed stable demand, rising to 39% in 2024 from 35% in 2023, following several years of consistent usage at around 40-41%. Pre- and probiotics registered an upward trend, growing from 10% in 2018 to 22% in 2024.\n\nDigestion supplements were used by 19% of American dog owners in 2024, reflecting steady demand. Immune boosters followed at 17%, maintaining moderate usage. The allergy supplement category, introduced in 2023, held steady at 17% in its second year.\n\nIn contrast, anxiety/calming supplements declined to 13% in 2024 from 16% in 2023, and are now significantly lower than 2018 levels. Skin, coat and nail supplements held steady at 27%, maintaining their position as the third most used supplement type.\n\nPet food\n\nWhen it comes to diet, dry food remains the most commonly fed, though it is gradually losing ground.\n\nIn 2024, 65% of dog owners in the US reported feeding dry food most often, down from 74% in 2018.\n\nFresh food has steadily gained traction, with usage doubling from 4% in 2018 to 8% in 2024. Canned food remained steady at 9%, while semi-moist and raw food options stayed niche, used by 5% and 3% of owners, respectively.\n\nFlea and tick\n\nFlea and tick medication use dropped to 62% in 2024, down from a recent high of 65% in 2023.  Tablets remained the most popular flea and tick treatment, with more than 4 out of 10 (44%) owners giving these products to their pets.\n\nInterest in all-natural or chemical-free flea and tick products also continued to rise, increasing to 21% in 2024 from 16% in 2018.\n\nOther product types held relatively stable. In 2024, 24% of dog owners used collars (down from 27% in 2018), 23% used shampoos (down from 30%) and 20% applied topical skin solutions (down from 27%). Use of yard treatment products declined more noticeably, from 17% in 2018 to 13% in 2024.\n\nMedications\n\nWhile usage of some preventive medications declined, others saw moderate growth. Antibiotic use rose to 12% in 2024, up from 5% in 2018.\n\nAllergy medications also increased to 12%, up from 4% over the same period. Ear treatments reached 13%, while pain relievers were given by 10% of owners, both reflecting gradual increases in chronic care and symptom management.\n\nHeartworm medication usage experienced a sharper decline, dropping to 27% in 2024 from 33% in 2018, indicating a significant year-over-year decrease.",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 4
  },
  {
    "title": "General Mills investor day: Company chases growth in pet food",
    "description": "The pet segment represents the largest growth opportunity for General Mills. Liz Mascolo, President of the North America pet segment, explained during General Mills’ Investor Day on 14 October that the business accounts for “only” 7% of the national pet food market. The multinational firm also pointed to resumed sales growth in its pet business […]",
    "url": "https://globalpetindustry.com/news/general-mills-investor-day-company-chases-growth-in-pet-food/",
    "date": "2025-10-16T08:00:54+00:00",
    "source_section": "Global Pet Industry",
    "sponsors": [],
    "_feed_full_text": "The pet segment represents the largest growth opportunity for General Mills. Liz Mascolo, President of the North America pet segment, explained during General Mills’ Investor Day on 14 October that the business accounts for “only” 7% of the national pet food market.\n\nThe multinational firm also pointed to resumed sales growth in its pet business during 2025. General Mills’ pet portfolio generated $2.5 billion (€2.2B) in FY2025, an increase compared to $2.4 billion (€2.1B) in 2024, matching 2023’s performance.\n\nAccording to Chairman and CEO Jeff Harmening, this figure tends to increase even more. “We acquired and grew a pet portfolio that is approaching $3 billion (€2.6B) in net sales”, he said during the event, referring to the acquisitions of Edgard & Cooper and Whitebridge Pet Brands .\n\nIn line with that, Dana McNabb, Group President for North America Retail and North America Pet units, said that the company’s focus is to “leverage our pet portfolio to tap into the pet humanization trend and accelerate our company’s growth.”\n\nDog vs. cat\n\nDog food remains the dominant category in General Mills’ pet segment, followed by cat food and treats.\n\nMascolo highlighted the investments in its Life Protection Formula line, especially salmon, which is “the fastest growing protein in dog dry feeding.”\n\nThe company is aiming to capture a share of the $3 billion (€2.6B) fresh food market, which is “significantly outpacing the overall pet category,” Mascolo said.\n\nShe underlined a strong investment in the launch of Love Made Fresh, with a distribution plan that will include the new line in more than 5,000 coolers by the end of the year. Launched in June, Love Made Fresh is part of the Blue Buffalo brand.\n\nAlthough it comes in second, the cat segment is outpacing the dog category’s growth, increasing from low single-digit growth in FY2025 to mid-single digits in the first quarter of FY2026.\n\nFinancial update\n\nIn September, General Mills reported $4.5 billion (€3.8B) in net sales for the first quarter of FY2026, a 7% year-over-year (YoY) decline in general.\n\nThe pet food business, anchored by the Blue Buffalo brand, experienced revenue growth but saw a decline in organic net sales. While cat food and pet treats’ net sales were up double digits, dog food was down.",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 5
  },
  {
    "title": "Financial snapshot: Growth slows in pet food, but premium shows resilience",
    "description": "Pet food producers tracked by GlobalPETS mixed varied performance in the second quarter of 2025. While some reported strong results, ahead of market expectations and analysts’ forecasts, others saw some of their financial indicators decline year-over-year (YoY). Big players with businesses across different categories, such as Nestlé and Colgate-Palmolive, posted better results in their pet […]",
    "url": "https://globalpetindustry.com/news/financial-snapshot-growth-slows-in-pet-food-but-premium-shows-resilience/",
    "date": "2025-10-15T11:47:14+00:00",
    "source_section": "Global Pet Industry",
    "sponsors": [],
    "_feed_full_text": "Pet food producers tracked by GlobalPETS mixed varied performance in the second quarter of 2025. While some reported strong results, ahead of market expectations and analysts’ forecasts, others saw some of their financial indicators decline year-over-year (YoY).\n\nBig players with businesses across different categories, such as Nestlé and Colgate-Palmolive, posted better results in their pet segments (Purina and Hill’s Pet Nutrition, respectively) than in their overall operations. \n\nThe reasons behind the positive results are varied, stemming from a combination of increased sales volume, a favorable price mix and the strengthening of premium categories, in addition to specific factors such as the acquisition of a new brand.\n\nLike big pet retailers , manufacturers also expressed concerns about the macroeconomic environment, uncertainty and a potential US tariff shock, but say they are well-positioned to deal with it – or at least are preparing for it. Firms also addressed cautious consumers across markets as a concerning point. \n\nColgate-Palmolive\n\nThe American multinational saw its net sales increase 1% YoY in Q2 2025 to $5.11 billion (€4.3B). The company’s sales increased by 1.8%, including a 0.6% negative impact from lower volumes of private-label pet sales. \n\nThe negative impact was “even greater” than in the first quarter, when they announced their intention to exit it. \n\nHill’s Pet Nutrition, which makes up 23% of the company’s sales, on the other hand, remains strong: its net sales grew 3.8% in the quarter (stronger than the 1.5% rise in Q1) and organic sales increased by 2% YoY.\n\nAccording to the company, the acquisition of Australian fresh pet food brand Prime100 earlier in the year increased Hill’s reported volume sales by about 1%.\n\nWhen we examine the H1, however, Colgate’s net sales were slightly weaker than in 2024 (-1%), while the overall pet nutrition sector rose 2.6% for the period. \n\nAccording to Colgate-Palmolive, their “focus on innovation and the strength of our global portfolio” helped get around “volatility in category growth and uncertainty in global markets”. \n\nThe company is focused on increasing productivity over the next few years to reduce costs, primarily by optimizing its supply chain and streamlining its organizational structure. \n\nFreshpet\n\nThe New Jersey-based company reported solid net income in Q2 : $16.4 million (€14.2M) compared to a net loss of $1.7 million (€1.5M) during the same period in 2024. \n\nThis increase was driven by higher sales, improved gross profit as a percentage of net sales and decreased selling and general and administrative expenses.\n\nNet sales increased by 12.5% YoY to $264.7 million (€228.6M), primarily driven by volume gains of more than 10% and a favorable price/mix of 1.7%.\n\n“Against a more challenging consumer sentiment backdrop, we continue to significantly outperform the dog food category, delivering both category-leading sales growth and strong improvements in operations,” says Freshpet’s CEO, Billy Cyr.\n\ni-Tail Corporation\n\nThe Thai pet food manufacturer reported sales growth of 8.1% YoY for the first half of the year. However, in Q2, net sales decreased by 2%.\n\nThe result was fueled by a 6.9% increase in sales volume and “robust demand from key customers and world pet food companies in both the US and EU markets”, the company says. It launched new projects in the US valued at $56 million (€52M) and the first shipments to new importer brands in the UK and Europe. \n\nThe Bangkok-headquartered company attributes a limit in revenue growth in local currency to the appreciation of the Thai Baht . \n\ni-Tail also reported a decline in gross profit margin, which went from 27.7% in 2024 to 24.6% in H1, and a 25% YoY decrease in net profit. According to the company, it is a “result of a lower proportion of premium products”. \n\nThe company says it is following a potential fallout from US tariff policies, and it is currently working with customers on cost-sharing plans while expanding its operations in low-tariff markets.\n\nNestlé\n\nThe Swiss multinational had a hard time in the first 6 months of 2025: it reported a 1.8% decrease in sales, going from CHF 45 billion ($56.4B/€48.4B) in the first half of 2024 to CHF 44.2 billion ($55.4B/€47.5B) in the same period of 2025.\n\nPet care brand Purina was the second strongest category in sales, reporting CHF 9.2 billion ($11.5B/€9.9B) (20.8% of total results). But its organic growth of 1.3% was smaller than the 2.9% reported by the total group. \n\nAccording to the company, its “super-premium science brands continue to show strong momentum,” while the entire pet category experienced a “general slowdown in growth.”\n\nNestlé highlighted that the petcare segment performed differently across regions. In Europe, it “delivered low single-digit growth, led by Felix, Purina ProPlan and Purina ONE, growth was RIG driven.” \n\nIn the Americas, “growth was positive, with solid performance in cat, offset by weaker category dynamics impacting sales in mainstream dog brands and snacks ”. \n\nAnd in Asia, Oceania and Africa, the category actually “posted negative growth, with strong growth in emerging markets, more than offset by category softness in developed markets.”\n\nSymrise\n\nThe German chemicals company’s sales fell 2.9% YoY from $1.27 billion (€1.08B) to $1.23 billion (€1.04B) in Q2. In H1, the decrease was smoother (-0.5%).\n\nOverall, in the first half of 2025, the Holzminden-based company registered an organic growth of 3.1% and a gross profit increase of 6%, due to “recurring cost savings”: through efficiency improvements of €40 million this year. \n\nThe pet food division maintained “flat organic sales despite continued cautious consumer sentiment across key markets,” the company says. Pet palatability recorded “solid” growth, largely from the European-African-Middle Eastern and Latin American regions. \n\nFull-year outlook\n\nColgate-Palmolive updated its guidance for full-year 2025, now expecting net sales to rise in the low single digits. The company projects organic sales growth at the low end of 2% to 4%, reflecting the planned exit from private-label pet sales over the course of the year. \n\nFreshpet also revised its full-year guidance downward. Net sales are now expected to increase 13% to 16% compared to 2024, down from the previous range of 15% to 18%. \n\nSymrise similarly lowered its organic growth forecast to 3%-5% from the prior 5%-7%, citing the current global demand environment as a key factor. \n\nNestlé, in contrast, maintained its 2025 guidance, forecasting higher organic sales despite “increased headwinds,” including the negative impact of existing tariffs and current foreign exchange rates.",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 4
  },
  {
    "title": "Pets become the new plus-ones on business trips",
    "description": "A recent survey shows that pet companionship now extends beyond vacations, with pets increasingly joining their owners on business trips as the new plus-ones. Data from TravelPerk, a Spain-based travel management company, shows that 1 in 10 employees have already traveled with their pets for work. This trend is especially common among younger workers, with […]",
    "url": "https://globalpetindustry.com/news/pets-become-the-new-plus-ones-on-business-trips/",
    "date": "2025-10-15T09:54:15+00:00",
    "source_section": "Global Pet Industry",
    "sponsors": [],
    "_feed_full_text": "A recent survey shows that pet companionship now extends beyond vacations, with pets increasingly joining their owners on business trips as the new plus-ones.\n\nData from TravelPerk, a Spain-based travel management company, shows that 1 in 10 employees have already traveled with their pets for work.\n\nThis trend is especially common among younger workers, with 21% of employees aged 25 and under reporting they have brought pets along on business trips. Among frequent travelers, the share is even higher, with 22% of those who travel weekly saying their pets accompany them.\n\nExecutives are also embracing the trend, with 16% of C-suite leaders reporting they have traveled with pets . Among non-executive travelers, the share is slightly lower at 11%, though still notable given that fewer in this group provide companions overall.\n\nRegionally, US employees are most likely to travel with pets for work (15%), followed by Germany (10%), the UK (8%) and Spain (7%).\n\nIn addition, airlines are embracing this trend, with major flag carriers such as Emirates, Qatar Airways, Lufthansa, Air France and Delta Air Lines now offering pet-friendly business-class flights.\n\nAccording to TravelPerk, the survey was conducted by OnePoll between 12 and 19 March 2025 and included 4,000 adults from the UK, US, Germany and Spain who travel for business.",
    "_skip_crawl": true,
    "relevant": false,
    "relevance_score": 2
  },
  {
    "title": "UK: Renters’ Rights Bill could unlock 1 million new pet requests",
    "description": "The Renters’ Rights Bill, introduced by the British Parliament in September 2024, is in its final stages and is expected to take effect in late 2025. The measure will give tenants the right to request approval to own a pet in a rented property, which landlords cannot unreasonably refuse. It will also allow renters to […]",
    "url": "https://globalpetindustry.com/news/uk-renters-rights-bill-could-unlock-1-million-new-pet-requests/",
    "date": "2025-10-14T10:10:01+00:00",
    "source_section": "Global Pet Industry",
    "sponsors": [],
    "_feed_full_text": "The Renters’ Rights Bill , introduced by the British Parliament in September 2024, is in its final stages and is expected to take effect in late 2025.\n\nThe measure will give tenants the right to request approval to own a pet in a rented property, which landlords cannot unreasonably refuse. It will also allow renters to challenge refusals if they believe they are unfair.\n\nA survey conducted by the UK -based comparison site Go.Compare found that 42% of respondents say they would make a request once the law takes effect, representing 1 million households.\n\nAdditionally, more than half (56%) of these prospective pet owners say they would choose to get a cat, and a similar amount (52%) want a dog. This would mean 597,000 households with a new cat and 555,000 with a new dog across the country.\n\nThe research was based on a YouGov survey of 2,000 UK renters on 28 May 2025. Respondents were selected at random across several demographics.\n\nThe current landscape\n\nThe survey found that 2 in 5 renters, or more than 2 million households, currently rent with a pet.\n\nAbout 743,000 households say their landlords had blocked pet requests, representing 16% of renters. Nearly 8 in 10 of those denied felt the decision was unreasonable, suggesting more than 590,000 households may have been unfairly prevented from keeping a pet.\n\nMore dog owners (17%) received rejections compared to cat owners (14%), as landlords see dogs as being more prone to causing problems.\n\nBecause of this, about 4 in 10 renters chose not to submit pet requests to their landlords, often assuming they would be rejected.\n\nReasons for rejections\n\nFor landlords, the most common reasons to reject a pet request from a renter include concerns about damage to their property and the risk of nuisance or noise to neighbors. “They also might suggest that the property is unsuitable for a certain pet, or that a pet means increased insurance costs,” Go.Compare adds.\n\nHowever, Go.Compare found that owners of unusual pets were the most likely to have their requests denied, with 25% of renters who own a lizard or snake and 20% of those with a hamster, gerbil or guinea pig reporting they had been blocked in the past.\n\nThe costs \n\nWhile the majority of renters who plan to get a pet are ready for expected costs like food (90%), toys and accessories (85%), microchipping (78%), medical bills (77%) and neutering fees (73%), Go.Compare says they are most likely to feel unprepared for more infrequent costs, like grooming (60%) and kennel or cattery fees (39%).\n\nWhen it comes to insurance, the majority, or 75%, say they would purchase pet insurance, but nearly a fifth (18%) note they weren’t sure whether they would get cover, and a further 8% state they wouldn’t.",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 3
  },
  {
    "title": "How retailers can capitalize on the growing demand for pet food",
    "description": "With pet food sales projected to reach $88 billion (€75.7B) in the US in 2025 according to estimates from the American Pet Products Association (APPA), there are big opportunities for retailers. A new report by the Food Industry Association (FMI), the national trade association for the food industry in the US, notes that retailers have […]",
    "url": "https://globalpetindustry.com/news/how-retailers-can-capitalize-on-the-growing-demand-for-pet-food/",
    "date": "2025-10-13T09:03:28+00:00",
    "source_section": "Global Pet Industry",
    "sponsors": [],
    "_feed_full_text": "With pet food sales projected to reach $88 billion (€75.7B) in the US in 2025 according to estimates from the American Pet Products Association (APPA), there are big opportunities for retailers.\n\nA new report by the Food Industry Association (FMI), the national trade association for the food industry in the US, notes that retailers have a good opportunity to profit if they use pet aisles and dedicated spaces to meet the needs of pets and their owners.\n\n“To capitalize on shoppers making a special trip for pet food purchases, create destination zones in-store that offer convenience and entertainment,” says Tom Duffy, FMI’s Senior Advisor of Industry Relations. \n\nThe industry body also recommends using cross-merchandising with complementary items, “such as positioning treats near grooming supplies.”\n\nPlanning purchases ahead \n\nNearly 8 out of 10 (79%) of shoppers plan their pet purchases ahead, according to Duffy. This is an opportunity for retailers to “showcase offerings in mailers, apps, websites, social media and in-store signage,” he adds. \n\nThe association advises retailers to make pet products easy to find and shop by creating a clear category, allocating space based on sales potential, aligning assortments with shopper needs, placing related items together, using signage to attract shoppers and maintaining consistent promotions and merchandising.\n\nOmnichannel opportunity \n\nAccording to FMI’s report, shoppers tend to spend more when they have omnichannel fulfillment options.\n\nData insights suggest that 20% of shoppers are buying more pet products online, while 31% purchase both online and in-store equally.\n\n“Retailers that offer seamless transitions between digital and physical channels, such as online ordering with in-store pickup or subscription services, can capture more share,” Duffy explains.\n\nWhen buying online, customers’ top reasons include ease of access, best value and high quality, affordability and a variety of choices.",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 4
  },
  {
    "title": "Petz-Cobasi: Brazilian regulators reopen review of pet retail merger",
    "description": "The announcement of the merger between the major Brazilian pet retailers Petz and Cobasi was followed by market buzz, the unrestricted approval of the country’s competition regulator and an appeal from competitor Petlove. Since it was filed in June, the Administrative Council for Economic Defense (CADE) reopened the appeal process in July and appointed counselor […]",
    "url": "https://globalpetindustry.com/news/petz-cobasi-brazilian-regulators-reopen-review-of-pet-retail-merger/",
    "date": "2025-10-13T08:57:04+00:00",
    "source_section": "Global Pet Industry",
    "sponsors": [],
    "_feed_full_text": "The announcement of the merger between the major Brazilian pet retailers Petz and Cobasi was followed by market buzz, the unrestricted approval of the country’s competition regulator and an appeal from competitor Petlove.\n\nSince it was filed in June, the Administrative Council for Economic Defense (CADE) reopened the appeal process in July and appointed counselor José Levi Mello do Amaral Júnior as the rapporteur of the case. \n\n“From what can be seen in the preliminary section, the appeal appears to present market data that deserves further investigation by the Court,” states Amaral.\n\nTherefore, he requested a 90-day extension to the 240-day legal deadline for completing the case review. This gives CADE’S Administrative Court until the end of the year to evaluate the matter.\n\nNew developments \n\nIn early September, the rapporteur requested an economic study on the offline and online pet retail market in Brazil to “support” the analysis of the case and “evaluate the need for any remedies, if applicable.” \n\nHe also asked for the inclusion of topics such as consumption habits, purchase occasions for goods and services and competitive pressures between the physical and digital markets.\n\nOn 17 October, there will be a public hearing aimed at “consulting and discussing with society” the competitive aspects related to the pet market. According to counsellor Amaral, this study should be combined with the evidence and reports presented by Petz, Cobasi and Petlove throughout the process.\n\nCADE sent letters in September to more than 90 competitors and 120 suppliers to conduct a market test and gather new evidence for the analysis.\n\nIn an interview with CNBC in Brazil, the president of Cade says that reopening and reassessing a case after an appeal is a natural move in mergers and acquisitions processes, that the initial decision was technical, but the court could uphold it or change it based on new evidence.\n\nBack on 12 August, the Brazilian Congress held a public hearing on the topic. This hearing, however, was held at the request of a representative and is not part of the CADE process, but aims to bring society into the discussion. At the time, neither Petz nor Cobasi accepted the invitation to participate in the meeting.\n\nThe merger of the pet retailers is expected to create a new leader in the largest market in South America, with a combined revenue of R$6.9 billion ($1.32B/€1.15B) and a combined network of nearly 500 stores .",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 5
  },
  {
    "title": "Provisur expands processing capabilities for increased market demands",
    "description": "The surge in pet ownership during the pandemic drove strong growth in the pet food industry, increasing demand for efficient, high-performance processing systems. Many manufacturers turned to Provisur® Technologies, headquartered in Chicago, Illinois, known for its robust machines used in separating, mixing and grinding, and forming. In line with its motto “Pushing Boundaries,” the company […]",
    "url": "https://globalpetindustry.com/news/provisur-expands-processing-capabilities-for-increased-market-demands/",
    "date": "2025-10-13T08:05:39+00:00",
    "source_section": "Global Pet Industry",
    "sponsors": [],
    "_feed_full_text": "The surge in pet ownership during the pandemic drove strong growth in the pet food industry, increasing demand for efficient, high-performance processing systems. Many manufacturers turned to Provisur® Technologies, headquartered in Chicago, Illinois, known for its robust machines used in separating, mixing and grinding, and forming.\n\nIn line with its motto “Pushing Boundaries,” the company helps producers improve yield and cost efficiency while supporting the use of a wider range of raw materials. Provisur’s portfolio includes established brands such as Hoegger, AM2C®, Beehive®, Formax®, Lutetia®, and Weiler®, recognized for their technological performance and reliability.\n\nHigh-performance applications\n\nOlivier Bazin, Area Sales Manager EMEA-CIS Separation Business Unit, describes current developments in the pet food market segment: “In order to meet the increased demand, the current trend among the major players in the industry is towards high-performance production lines that can process large volumes and at the same time drive automation in the industry.”\n\nPeter Berkensträter, Provisur Account Manager Central and Eastern Europe/Central Asia adds: “We are seeing that pet food processors are increasingly investing in first-class quality systems and that their products comply with the same safety and hygiene standards as those applied to non-pet food items. Another trend that is currently emerging is that many food manufacturers are now also producing for the pet food segment.”\n\nOverall, the specialists at Provisur have observed that pet food suppliers are focusing on making their processes even more efficient and profitable in the wake of increased raw material costs and global supply chain bottlenecks. This is where Provisur’s high-performance systems come into play, offering innovative, modern, and profitable solutions for processes such as separation, mixing and grinding.\n\nSeparation systems\n\nThe Provisur portfolio includes a wide range of systems for separating meat or fish that optimally meet the needs of the pet food industry. These include, for example, the separators of the particularly powerful Beehive S series, which separate meat, poultry and more at high speed and maximize recovery yield thanks to the innovative screw and filter technology.\n\nThey are characterized by their robust design and are therefore ideal for processing large quantities of raw materials. Their innovative, extremely durable ceramic components reduce maintenance requirements and thus lead to lower maintenance costs. The modular Barracuda separation system from Provisur is also highly sought after by pet food producers. It combines \n\nthe outstanding separation technologies of the Beehive and AM2C brands to create a new standard of excellence for this application. The Barracuda series deploys a high-pressure system that increases throughput while minimizing the temperature rise in the end product, which in turn increases product safety. The bottom line is that users of this innovative separation technology benefit from optimized yields.\n\nMixing and grinding: Weiler for quality and reliability\n\nWhen it comes to mixing and grinding pet food components, the renowned Weiler brand from the Provisur portfolio is the brand of choice for many producers. For eight decades now, these mixing and grinding systems have been used for both food and pet food production and are still used by many major manufacturers in the industry today.\n\nThe Weiler Dominator 14 grinder is one of the outstanding system components for this application. It not only achieves first-class product quality but also delivers extremely high throughput, thereby meeting the needs of large manufacturers in the industry. The system is suitable for the fast processing of beef, pork, and further raw materials.\n\nOther system components for this segment are the Weiler Dominator mixers and mixer grinders. They use the unique balanced flow technology developed by Provisur . This ensures that the product flow is always optimal: backflow and the subsequent overloading of the product are virtually eliminated. The double overlapping, counter-rotating paddles are particularly advantageous for perfect mixing. The stainless-steel machines are equipped with correspondingly powerful motors.\n\nAnother unique feature is the design with its reduced number of components, e.g. only one hole plate. In addition, almost all screws are made from a single piece of material. “All these features make the Weiler Dominator range particularly reliable and low maintenance. The low operating costs are unparalleled and have generated interest in the pet food industry and beyond,” says Peter Berkensträter.\n\nFurther applications: from formed veterinary products to treats\n\nThe latest generation of the market leading Formax forming technology from the Provisur portfolio is available for the veterinary pharmaceuticals market. These highly efficient systems can be used to produce formed products such as medication for dogs or cats.\n\nLutetia tumblers are ideal for pet food suppliers looking for efficient smaller volume solutions for certain process steps in the production of treats for dogs or cats. These versatile tumblers can be used in a variety of ways: drying, cooking with steam, dry cooking with heated air or cooking previously vacuum-packed products at a relatively low temperature. They maximize throughput while reducing cycle times and producing high-quality end products.\n\nTapping into new sources\n\nVarious Provisur systems have become firmly established in many areas of the pet food industry. Current trends are contributing to the continuous expansion of this spectrum. Provisur specialists are now experiencing how market trends from the food industry are reaching into the pet food segment.\n\nPeter Berkensträter explains: “Many pet owners treat their pets like a fully-fledged member of the family. We hear from our customers that this also has an impact on choice of food, and that aspects similar to those at play in human nutrition are becoming increasingly important in pet food.”\n\nIn short, pet owners are becoming better informed about the health of their four-legged family members, knowing that food can have a direct impact. As a result, they are increasingly looking for higher quality, as well as more natural and healthier ingredients. This leads to a willingness to pay a higher price for pet food – and thus to the growth of the premium segment.\n\n“Sustainability concerns such as reduced meat consumption also have an influence on the purchasing  behavior of pet owners and therefore on the pet food market. Provisur is currently working intensively on sustainable solutions to open up new sources of low-cost raw materials for the pet food industry. For example, added vegetables or new sources of protein such as insects or larvae. The industry can look forward to news from our research and development efforts,” promises Olivier Bazin.\n\nAbout Provisur  Technologies:\n\nProvisur Technologies of Chicago, Illinois, USA, with numerous branches globally, specializes in innovative industrial food processing machines as well as integrated production systems for a wide range of end products. Several well-known and time-honored brands, which are among the technology leaders in the sector, operate under the umbrella of the company.\n\nWith its product portfolio, divided into the areas of Slicing (Cashin , Formax , Hoegger ), Further Processing (Weiler and Formax ), DMC (Lutetia ) and Separation (AM2C , Beehive , Hoegger ), Provisur provides food processing companies with maximum efficiency solutions for requirements of any size. \n\nDevelopment and testing can be conducted at Provisur’s Innovation Center (PIC) in Plailly near Paris, as well as the PIC in Mokena, IL, USA, offering food manufacturers the opportunity to experience the full range of Provisur equipment.",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 4
  },
  {
    "title": "UK: New best-practice guidelines for pet groomers raise the bar",
    "description": "Professional pet grooming is under growing scrutiny in the UK as industry bodies step up efforts to ensure animal welfare and professional accountability.  The Canine and Feline Sector Group (CFSG) in partnership with the Pet Industry Federation (PIF), published earlier in June the so-called Best Practice Guidelines for Dog and Cat Groomers, outlining a broad […]",
    "url": "https://globalpetindustry.com/news/uk-new-best-practice-guidelines-for-pet-groomers-raise-the-bar/",
    "date": "2025-10-10T13:40:37+00:00",
    "source_section": "Global Pet Industry",
    "sponsors": [],
    "_feed_full_text": "Professional pet grooming is under growing scrutiny in the UK as industry bodies step up efforts to ensure animal welfare and professional accountability. \n\nThe Canine and Feline Sector Group (CFSG) in partnership with the Pet Industry Federation (PIF), published earlier in June the so-called Best Practice Guidelines for Dog and Cat Groomers , outlining a broad framework that covers everything from handling and hygiene to legal obligations and environmental impact.\n\nWhile pet grooming remains largely unregulated in the UK in terms of licensing, that doesn’t exempt professionals from their responsibilities. Under the Animal Welfare Act 2006, groomers are legally defined as temporary keepers of pets in their care, meaning they can be held criminally liable for neglect or harm, even if it’s unintentional.\n\nRegulatory path \n\nThe CFSG document highlights key welfare needs, from suitable environments to appropriate socialization and how these translate into day-to-day grooming operations. \n\nThis includes everything from safe holding areas and clean equipment to stress reduction techniques for anxious pets.\n\nImportantly, the report also notes that failing to provide basic needs, such as clean water, secure enclosures and comfort breaks, could be a breach of the law, providing a clear warning to businesses operating in the industry. \n\nGrooming salons must also consider transport safety, waste management and emergency planning. From first-aid kits and incident logs to clean vehicle interiors and appropriately sized pet crates, professional standards extend well beyond the grooming table.\n\nThe report encourages salons to establish clear policies on everything from cancellation fees to procedures for hot weather. Lone workers are advised to maintain safety precautions, such as locking doors and keeping mobile phones nearby.\n\nPet comfort \n\nThe guidelines place a strong emphasis on individual care, requiring groomers to assess each pet’s temperament, health, age and medical history before commencing treatment. Dogs or cats that show signs of anxiety or aggression may require special handling, or no grooming at all, if they pose a risk.\n\nThe goal is to reduce stress and provide a positive grooming experience, particularly for nervous or first-time pets. Owners are encouraged to leave familiar items, such as towels with their scent, to help ease their pet’s anxiety. Written consent is required for procedures such as dematting or full clips.\n\nPets should not be left unattended. Drying methods must be controlled and safe. No invasive procedures (such as anal gland expression or tooth scaling) are permitted unless under the direction of a veterinarian.\n\nCat grooming, while growing in popularity, is highlighted as a distinctly different process from that of dogs. \n\nFelines must be housed separately, ideally in different enclosures, and should be handled in calm, controlled environments. The use of loud equipment or scented products is discouraged, and grooming may need to be kept brief if the cat does not adjust well.\n\nFor groomers, the emphasis is on competence and care. The report recommends a minimum Level 2 OFQUAL qualification, with additional training in breed-specific grooming, handling of elderly or disabled animals, and pet first aid. Continuing professional development (CPD) is also encouraged.\n\nIndustry commitment  \n\nPFI’s CEO, Nigel Baker, says the new set of guidelines shows the pet grooming sector’s commitment to continuous improvement and professional excellence. \n\n“We’re particularly pleased that the guidelines address the individual needs of different pets, recognizing that a nervous rescue dog requires very different handling from a show-trained poodle and that cats have completely different requirements from dogs,” he adds. \n\nBaker encourages all groomers to adopt these guidelines and help raise the bar across the entire sector.\n\nGrowing industry\n\nThe global pet grooming services market is projected to reach $7.6 billion (€6.5B) in 2025 and is anticipated to grow at a compound annual growth rate of 7.5% through 2032, according to Coherent Market Insights.\n\nThe growth is part of the humanization of pets trend, which increasingly gives them status as fully-fledged family members with a strong focus on their health, well-being and appearance. \n\nWhile animal welfare legislation is widespread, specific regulations for pet groomers remain patchy globally, with some notable developments.\n\nLast year, the Regional Council of Lombardy, the legislative assembly of the northern Italian region, introduced a bill aimed at regulating the pet grooming industry in a bid to ensure high standards of pet protection.\n\nEffective mid-2024, Malta introduced mandatory standards for pet groomers, sitters, and boarders, which require registration with the Animal Welfare Directorate and qualified staff, at least one of whom must be trained in Animal First Aid, record-keeping, vaccinations and inspection protocols.\n\nWhile in Australia, the New South Wales government published an Animal Welfare Code for pet grooming establishments.\n\nElsewhere, specific regulations are more likely to focus on products in conjunction with animal welfare laws.",
    "_skip_crawl": true,
    "relevant": false,
    "relevance_score": 2
  },
  {
    "title": "From field to formula: premium potato ingredients direct from the source",
    "description": "As a pioneer in circular, CO₂-reducing ingredients, FeedValid is strengthening the sustainability and resilience of the pet food supply chain: one premium potato blend at a time. Whether you’re formulating a grain-free recipe or looking to improve digestibility and nutritional value, the company’s Protato® range delivers. Manufactured at its facilities in Nieuwdorp, Overloon, Oosterhout and […]",
    "url": "https://globalpetindustry.com/news/from-field-to-formula-premium-potato-ingredients-direct-from-the-source/",
    "date": "2025-10-10T07:19:41+00:00",
    "source_section": "Global Pet Industry",
    "sponsors": [],
    "_feed_full_text": "*]:pointer-events-auto scroll-mt-[calc(var(--header-height)+min(200px,max(70px,20svh)))]\" dir=\"auto\" tabindex=\"-1\" data-turn-id=\"a18557c5-e7b8-441f-9585-7291ed83dd04\" data-testid=\"conversation-turn-2\" data-scroll-anchor=\"true\" data-turn=\"assistant\">\n\nAs a pioneer in circular, CO₂-reducing ingredients, FeedValid is strengthening the sustainability and resilience of the pet food supply chain: one premium potato blend at a time. Whether you’re formulating a grain-free recipe or looking to improve digestibility and nutritional value, the company’s Protato® range delivers. Manufactured at its facilities in Nieuwdorp, Overloon, Oosterhout and Poederoijen (NL), these ingredients are designed for manufacturers who won’t compromise on quality or sustainability.\n\nHigh-quality potato ingredients for pet food producers\n\nConsistent premium quality with guaranteed batch-to-batch performance\n\nEuropean production with known origin and full traceability\n\nEco-friendly processing using residual heat for drying, improving your CO₂ footprint\n\nWide product range, including Protato® 3CN, 4CN, 7C, 77S, and the well-known 25/35/45 Protato® mixes\n\nCustom blends tailored to your recipe and nutritional goals\n\nGlobal delivery in bulk or big bags, even at short notice\n\nAt FeedValid, quality is ensured through controlled processes, consistent performance, and dependable logistics. Since partnering exclusively with Rodenburg in 2024, the company expanded its R&D and production capacity to support the evolving needs of the pet food sector.\n\nFrom a buyer’s perspective\n\nIf you’re a pet food purchaser looking for safe, high-quality ingredients, switching to FeedValid’s potato mixes is a risk-free, future-proof decision.\n\nTransitioning is easy, no technical or performance hiccups\n\nYou diversify your supplier base, reducing dependency\n\nYou gain a partner that invests in your long-term success\n\nReady to upgrade your recipe?\n\nFeedValid invites you to experience the convenience, reliability, and innovation that come from working directly with one of Europe’s largest producers of premium pet food ingredients.\n\nFor more information or to request samples, custom blends, or technical documentation, please contact your usual representative at FeedValid , ProCeres or Roots Ingredients .",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 3
  },
  {
    "title": "Hill’s Pet Nutrition appoints Rauf Gurbuz as U.S. President and General Manager",
    "description": "Hill’s Pet Nutrition, a division of Colgate-Palmolive and a global leader in science-led pet nutrition, has announced the promotion of Rauf Gurbuz to U.S. President and General Manager, effective October […]",
    "url": "https://internationalpetfood.com/hills-pet-nutrition-appoints-rauf-gurbuz-as-u-s-president-and-general-manager/?utm_source=rss&utm_medium=rss&utm_campaign=hills-pet-nutrition-appoints-rauf-gurbuz-as-u-s-president-and-general-manager",
    "date": "2025-10-16T09:24:40+00:00",
    "source_section": "International Pet Food",
    "sponsors": [],
    "_feed_full_text": "Hill’s Pet Nutrition, a division of Colgate-Palmolive and a global leader in science-led pet nutrition, has announced the promotion of Rauf Gurbuz to U.S. President and General Manager, effective October 15. Gurbuz succeeds Yvonne Hsu, who was recently named President of Hill’s Pet Nutrition.\n\n“We are delighted to welcome Rauf Gurbuz to Hill’s Pet Nutrition,” said Hsu. “His understanding of diverse markets and ability to drive growth will be invaluable as we continue our mission to transform the lives of pets and their families through science-led nutrition and innovation.”\n\nIn his new position, Gurbuz will oversee Hill’s operations in the United States, furthering the company’s growth and innovation strategy. Increasing science-based nutrition to meet changing pet needs, bolstering Hill’s leadership in wellness and therapeutic pet food categories, and providing the medical community with the most up-to-date information and tools to maximise pet health outcomes are some of his top priorities.\n\nHaving worked for Colgate-Palmolive for over 20 years, Gurbuz most recently held the position of Senior Vice President and General Manager, Asia Pacific Division, Greater Indochina Hub. He oversaw a profitable business transition during his time there that increased organic sales and market share in a number of geographies and product categories.\n\n“I am honoured and energised to lead the Hill’s U.S. team,” said Gurbuz. “My career at Colgate-Palmolive has been defined by a passion for building brands that make a tangible impact, and I am excited to bring that dedication to Hill’s mission of enriching and lengthening the special relationships between people and their pets.”\n\nGurbuz started working with Colgate-Palmolive Türkiye in 2004 and has since held a number of executive roles in customer development and general management. He graduated from Boğaziçi University in Istanbul with a Bachelor of Science in Mechanical Engineering.\n\nHill’s Pet Nutrition was established over 75 years ago and is still dedicated to promoting science-based pet nutrition. The company, which employs around 200 veterinarians, PhD nutritionists, and food scientists, keeps up its innovative research to help pets live healthier, longer lives. Veterinarians and pet owners around the world trust its top brands, Hill’s Prescription Diet and Hill’s Science Diet.",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 4
  },
  {
    "title": "PFI President and CEO Dana Brooks to step down after seven years of leadership",
    "description": "The Pet Food Institute (PFI) has announced that its President and CEO, Dana Brooks, will step down next year after leading the organisation since 2018. She will remain in her […]",
    "url": "https://internationalpetfood.com/pfi-president-and-ceo-dana-brooks-to-step-down-after-seven-years-of-leadership/?utm_source=rss&utm_medium=rss&utm_campaign=pfi-president-and-ceo-dana-brooks-to-step-down-after-seven-years-of-leadership",
    "date": "2025-10-13T15:43:33+00:00",
    "source_section": "International Pet Food",
    "sponsors": [],
    "_feed_full_text": "The Pet Food Institute (PFI) has announced that its President and CEO, Dana Brooks , will step down next year after leading the organisation since 2018. She will remain in her role and continue to be fully engaged in PFI’s advocacy and regulatory work for its members as the search for her successor begins.\n\n“As someone who firmly believes in the unconditional love between humans and their pets, the human-animal bond, I am honoured to have led this organisation for more than seven years,” said Brooks. “I am fortunate to continue my work through April 2026 in guiding PFI and advancing the interests of our members to help cats and dogs live long and healthy lives, even as we plan for the transition to new leadership.”\n\nDana Brooks, President and CEO of PFI.\n\nHaving represented agricultural and animal health interests in Washington, D.C., for more than 20 years, Brooks is a reputable voice in the pet food industry. She held important leadership positions in the American Farm Bureau Federation, Elanco Animal Health, the National Milk Producers Federation, and Land O’Lakes before joining PFI.\n\n“Dana’s impact over the last seven-and-a-half years is immeasurable,” said Scott Salmon , President at Simmons Pet Food and Chair of the PFI Board. “Her leadership has been instrumental to the success of our work, and she will be deeply missed.”\n\nBrooks has been acknowledged for her impact; she was listed on Pet Age’s Power 50 list and named a Woman of Influence. In addition, she served on the Board of Pet Partners and was honoured with the Women in Agribusiness Ambassador Award.\n\nTo choose the future leader, a board search committee has been established and will collaborate with an executive search firm. Brooks and the PFI Board are dedicated to making sure the transition goes smoothly and that the organisation’s momentum and goal of offering safe, healthful pet food for cats and dogs are maintained.",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 3
  },
  {
    "title": "UK’s first microbial protein dog treats hit the market with The Pack and MicroHarvest collaboration",
    "description": "The UK pet food market welcomes a bold innovation as The Pack and MicroHarvest unveil Gut Bites, the nation’s first microbial protein dog treats — a gut-friendly, allergy-conscious, and sustainable […]",
    "url": "https://internationalpetfood.com/uks-first-microbial-protein-dog-treats-hit-the-market-with-the-pack-and-microharvest-collaboration/?utm_source=rss&utm_medium=rss&utm_campaign=uks-first-microbial-protein-dog-treats-hit-the-market-with-the-pack-and-microharvest-collaboration",
    "date": "2025-10-13T07:00:00+00:00",
    "source_section": "International Pet Food",
    "sponsors": [],
    "_feed_full_text": "British animal-free pet food brand THE PACK and German biotech startup MicroHarvest today announce the launch of Gut Bites, a first-of-its-kind microbial protein dog treat for the UK market.\n\nThe UK pet food market welcomes a bold innovation as The Pack and MicroHarvest unveil Gut Bites, the nation’s first microbial protein dog treats — a gut-friendly, allergy-conscious, and sustainable snack for modern dogs.\n\nMicroHarvest’s proprietary microbial protein, a next-generation ingredient made by sustainable fermentation, is combined with The Pack’s functional, allergy-friendly formulation in Gut Bites, which are specifically designed for dogs with sensitivities, allergies, and selective appetites. A healthy substitute for conventional meat-based snacks, the end product is a tasty, clean, and easily digested delight. With this launch, Gut Bites is positioned at the forefront of sustainable innovation in the pet food market and is the first company to offer treats made with microbial protein to pet owners in the UK.\n\nIn a recent consumer survey with Wageningen University, 77.2% of German and UK dog owners stated they would purchase treats containing microbial protein, and 78.4% indicated they would think about using it in place of whole dog food. This indicates that the market is ready. Tests of palatability also revealed high acceptance: 58% of small dogs preferred food with MicroHarvest protein and consumed 44% more of it than regular kibble.\n\nTHE PACK co-founders – Damien Clarkson, Judy Nadel & Blossom\n\n“Our community of dog owners often tells us they struggle with picky eaters and pets with allergies,” said Damien Clarkson, Managing Director of Prefera Pet Food UK, which operates THE PACK. “Gut Bites is our answer, a delicious, functional treat that’s also allergy-friendly. MicroHarvest’s microbial protein stood out as a game-changer, helping us deliver something innovative, healthy, and sustainable.” Katelijne Bekers, CEO of MicroHarvest , added: “Entering the UK, where 36% of households own a dog, is a major step for us. This collaboration shows microbial protein isn’t just a sustainable solution; dogs truly enjoy it. Gut Bites proves that health, taste, and environmental responsibility can go hand in hand.”\n\nSince the manufacture of pet food is thought to produce 106 million tonnes of CO₂ a year, MicroHarvest’s protein provides an alternative that reduces the environmental impact by more than 90% when compared to beef and doesn’t require any farms, fertiliser, or pesticides.\n\nThe launch solidifies MicroHarvest’s position in shaping the future of sustainable pet feeding and comes after the company’s successful collaboration with Germany’s VEGDOG in 2024. After launching the world’s first cultured meat treat earlier this year, Gut Bites is carrying on its tradition of inventing next-generation proteins for THE PACK. The launch of Gut Bites in the UK is a significant turning point for pet owners looking for wholesome, eco-friendly substitutes that keep their furry friends happy.",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 4
  },
  {
    "title": "PFX expands pet supplement reach with FoodScience brands",
    "description": "Pet Food Experts (PFX) has expanded its distribution of FoodScience Brands’ Pet Naturals and VetriScience supplement lines to the Pacific Northwest region of the U.S. The action expands the brands’ […]",
    "url": "https://internationalpetfood.com/pfx-expands-pet-supplement-reach-with-foodscience-brands/?utm_source=rss&utm_medium=rss&utm_campaign=pfx-expands-pet-supplement-reach-with-foodscience-brands",
    "date": "2025-10-10T15:35:11+00:00",
    "source_section": "International Pet Food",
    "sponsors": [],
    "_feed_full_text": "Pet Food Experts (PFX) has expanded its distribution of FoodScience Brands’ Pet Naturals and VetriScience supplement lines to the Pacific Northwest region of the U.S. The action expands the brands’ current PFX presence in the Midwest, Ohio Valley, Northeast, Mid-Atlantic, Mountain, and West areas.\n\nBoth Vermont-based companies are well-known for their scientifically supported formulas; VetriScience specialises in supplements, while Pet Naturals sells pet treats and vitamins. Every product is created without fillers or unidentified substances and with consultation from veterinarians.\n\n“We at Pet Food Experts pride ourselves on bringing healthy, tasty pet treats and supplements to our retailers and their customers,” said Brianne Straus, Director of Vendor Development at PFX. “These brands’ commitment to quality and pet health makes them a perfect fit in the PFX family.” Kate Sterling, Director of Sales, Animal Business, added, “We’ve already built great relationships as part of the Pet Food Experts family, and this expansion allows us to reach even more pet owners with our vet-formulated products designed for dogs and cats’ daily health.”\n\nWith this latest regional expansion, Pet Food Experts continues to strengthen its role as a leading distributor of trusted, health-focused pet products across the U.S.",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 3
  },
  {
    "title": "Ghostdog Pets launches Sync: Smart nutrition for sensitive pets",
    "description": "Ghostdog Pets Ltd, an impact-driven UK pet innovation company, has launched its first brand, Sync, at PATS 2025 in Birmingham. With a 5-in-1 composition that addresses digestion, immunity, skin and […]",
    "url": "https://internationalpetfood.com/ghostdog-pets-launches-sync-smart-nutrition-for-sensitive-pets/?utm_source=rss&utm_medium=rss&utm_campaign=ghostdog-pets-launches-sync-smart-nutrition-for-sensitive-pets",
    "date": "2025-10-09T15:38:25+00:00",
    "source_section": "International Pet Food",
    "sponsors": [],
    "_feed_full_text": "Ghostdog Pets Ltd, an impact-driven UK pet innovation company, has launched its first brand, Sync, at PATS 2025 in Birmingham. With a 5-in-1 composition that addresses digestion, immunity, skin and hair, joint mobility, and cognitive health, Sync was created to satisfy the increasing need for functional pet nutrition in dogs with allergies and sensitivities.\n\nA Ghostdog Pets poll found that 35% of pets in the UK had allergies or sensitivities, with skin and digestive problems being the most prevalent. Nevertheless, owners have few choices in spite of this expanding necessity. By combining pre- and postbiotics, DHA algae, and premium, scientifically supported nutrition with duck, turkey, lamb, and insect protein, Sync seeks to close that gap and provide balanced, comprehensive meals.\n\n“Pet parents are looking for nutrition that truly works for sensitive pets,” said Glenn Rankin, Founder of Ghostdog Pets. “At Ghostdog, we’re committed to doing things differently, offering independent retailers exclusive access to a product that delivers real results and trust through a 100% Money Back Guarantee.”\n\nA key component of Sync’s philosophy is sustainability. Its insect protein helps pet owners feed more intelligently while lessening their influence on the environment because it consumes 80% less land, water, and emissions than traditional sources. With full availability starting in January 2026, Sync will only be offered through independent merchants and direct-to-consumer channels.\n\nWith solutions that strike a balance between science, sustainability, and sensitivity, Ghostdog Pets, supported by a group of seasoned industry veterans, is poised to transform the pet nutrition market. Sync ushers in a new era where pets can live happier, healthier lives because to functional nutrition and intelligent ingredients.",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 3
  },
  {
    "title": "10 takeaways: Spinach as superfood in dog and cat food formulations",
    "description": "Many pet food brands now highlight spinach in their formulations, and it may offer health benefits to dogs and cats.",
    "url": "https://www.petfoodindustry.com/nutrition/pet-food-ingredients/article/15769354/10-takeaways-spinach-as-superfood-in-dog-and-cat-food-formulations",
    "date": "2025-10-14T06:00:34+00:00",
    "source_section": "Petfood Industry",
    "sponsors": [],
    "_feed_full_text": "Perhaps no other plant has such a reputation for boosting strength as spinach, thanks to a certain cartoon sailor, and spinach benefits dogs and cats too.\n\nSpinach is at the top of the superfoods list, wrote Greg Aldrich, Ph.D.,  Kansas State University  research associate professor, in his Petfood Industry column, “ Spinach: Is this original superfood beneficial for dogs and cats?” Spinach is widely considered a superfood thanks to its natural antioxidants, phytonutrients, functional fiber, vitamins and minerals.\n\nMany pet food brands now highlight spinach in their blends, and it may offer similar health benefits to dogs and cats.\n\nSpinach is a leafy green from central and western Asia and belongs to the Amaranth family, related to beet and quinoa.\n\nChina is the largest producer globally; the U.S. is far behind but has been increasing per‑capita consumption to about 1.5   lb per person.\n\nSpinach is distributed under U.S. No.   1 or U.S. No.   2 grades; the same supply chain largely supports pet food use.\n\nWhen dried into flakes, leaves are cleaned, dewatered, dried (tray or drum), and sized before packaging.\n\nFresh spinach is mostly water (~91   %), which limits macronutrient concentrations (e.g. ~2.9   % protein, ~0.4   % fat).\n\nOn a dry‑matter basis, spinach contains high levels of dietary fiber (~25   %) and significant micronutrients (potassium, iron, folate, vitamin   K, carotenoids, etc.).\n\nIt also contains secondary metabolites (flavonoids, phenolic acids) with antioxidant and anti‑inflammatory potential, plus compounds like chlorophyll and nitrates that might have additional physiological effects.\n\nSpinach has existed in dog diet research since at least 1918; more recent work shows chlorophyll from spinach is absorbed in dogs and may support cellular antioxidant activity, immune function or cognition.\n\nIn pet foods or treats, spinach is typically included at low levels (   %) due to cost and processing stability. Its benefit may be diluted at such inclusion rates.\n\nNonetheless, spinach offers nutritional, functional, marketing, and health maintenance value, and its superfood branding appears to have a credible foundation in modern dog and cat diets.",
    "_skip_crawl": true,
    "relevant": false,
    "relevance_score": 2
  },
  {
    "title": "Cost-effective sustainability drives pet food packaging trends",
    "description": "As sustainability needs continue to evolve, cost has become a significant factor in the conversation.",
    "url": "https://www.petfoodindustry.com/packaging/pet-food-packaging/article/15752987/costeffective-sustainability-drives-pet-food-packaging-trends",
    "date": "2025-10-10T07:05:00+00:00",
    "source_section": "Petfood Industry",
    "sponsors": [],
    "_feed_full_text": "If there’s one thing the packaging industry knows about, it’s sustainability. Long the front line for reduce-reuse-recycle campaigns as well as more complex combinations of eco-demands, packaging innovation is being driven by the ever-evolving concept of a sustainable container. Pet food in particular has grappled with the idea for years now, the most visible target of a larger consumer desire for more conscientious production on the manufacturer side and more intentional purchasing on the pet owner side.\n\n“ Sustainability remains the most prominent trend in pet food packaging,” said Oksana Lylak, director of packaging engineering for BSM Partners , a business services consulting firm operating in the pet care space. “Whether driven by brand values, consumer demand or tightening regulations like extended producer responsibility (EPR), the push toward sustainable solutions is shaping packaging decisions across the board. Brands are actively seeking materials and designs that minimize environmental impact — be it through recyclability, compostability or reduced material use — while still maintaining performance.”\n\nIt's also a trend that doesn’t seem to be going anywhere, driving changes in how pet food is packaged and how sustainability messaging is presented.\n\n“Sustainability has moved to the forefront, with brands increasingly adopting polyethylene-based packaging featuring How2Recycle labels and Design for Recycling principles, while incorporating ISCC+ certified circular content and post-consumer recycled materials,” said William J. Barlow, Jr., senior market development manager at packaging solutions provider Printpack . “This shift reflects growing consumer consciousness, particularly among the younger demographic, who actively seek brands that demonstrate environmental responsibility.”\n\nThe top challenge in sustainability: Cost\n\nSustainability as an idea is laudable, and parts of it can and are being executed in the packaging space. But everything comes with a cost, and while innovation is occurring and technologies are even now being developed, it can currently be expensive to work within the reality of what packaging can currently promise.\n\n“ Consumers are educated; everyone and their dog wants eco-friendly packaging,” said Anthony Testa, creative director at design services company Testa Concepts . “Compostable, recyclable, biodegradable, reusable — [but] sustainable materials are expensive. You want compostable, plant-fiber zip bags? Hope you like 30% margin loss.”\n\nIt’s a thin line to walk, particularly when consumers are asking for things without fully grasping the cost implications.\n\n“Cost-effective sustainability continues to be key with pet food packaging,” said Kristin Oyler, director of marketing and communications at Mondi Jackson , a sustainable and flexible packaging company. “Consumers are demanding sustainable packaging while at the same time concerned about the rising costs of being a pet parent. Suppliers need to continue developing cost-effective solutions. In today’s environment, sustainability can mean an array of options, and brands will need to work with partners that can help them meet their objectives.”\n\nHow can the packaging industry best work with pet food manufacturers to meet all goals, particularly when cost is involved?\n\n“ Cost remains a significant obstacle for many brands pursuing sustainable packaging formats,” said Lylak. “These materials often carry a higher price point, and small to mid-sized brands in particular may struggle to absorb or pass along those costs. This can lead to higher prices on shelf, something that may deter cost-conscious shoppers. That is why consumer education is critical — not just to inform, but  to reshape perceptions. Brands have an opportunity to help lead this shift, educating consumers and reframing sustainable packaging as a shared investment in the future. While recyclable packaging may raise the price of a product today, the long-term environmental return is far more valuable.”\n\nWhat about paper packaging?\n\nIf it was simply a matter of the entire industry doing a 1:1 swap out of a current material for a more sustainable option, discussion might have been settled by now, at least regarding what pet food comes in. But, of course, multiple factors beyond cost still feed into that primary concern.\n\n“Packaging that will serve consumers well into the future must be easy to use, easy to store and easily recycled,” said Lauryn Lueken, senior marketing manager at packaging company Tetra Pak . “That same package must be able to preserve the integrity of the product as it was made, protecting the nutrients, flavor, texture and look of the product inside. Of course, consumers will seek out the convenience of buying their preferred pet food across a variety of retail platforms, so an omnichannel offering is also a must.”\n\nTetra Pak has been working within the realm of sustainability for some time, making it a significant callout of its business and producing Tetra Recart , a carton containing up to 71% paper-based content that can handle the retort process and boasts convenience factors for the end consumer in addition to its sustainability attributes.\n\n“The top focus is delivering solutions that meet the evolving needs of consumers in innovative ways, all while remaining cost efficient,” said Lueken. “Tetra Recart cartons are a great example of enhancing the user experience through features like compact storage, sustainable packaging and product protection. And in today’s dynamic market landscape, it’s essential to ensure packaging upgrades don’t significantly impact retail prices or operational costs.”\n\nPhoenix Bark is an example of a pet food manufacturer going all in on the concept of sustainability, including with its packaging, and showing just how deeply the commitment can go with existing resources.\n\n“ Most decisions still seem to be made with budget first — and if there’s room at the end, the environment gets a nod,” said Duncan and Kathy Randall, co-founders of the Ireland-based fresh pet food company. “ For us, it’s the other way round. We start with what’s best for the planet — then we work tirelessly to make it commercially viable. That’s how we became the first in the world to wrap wet dog food in paper, five years ahead of anyone else. We use If You Care paper. It ticks every box and, in some cases, we think it helped define them.”\n\n( If You Care is a sustainability-forward company that produces products with a view to reducing the amount of waste in commercial waste streams, aiming for zero waste remaining after product use and disposal.)\n\nThe future of sustainability and pet food packaging\n\nPackaging, of course, is just one part of the sustainability picture, and everything pet owners are asking for under that umbrella plays a part in moving the trend forward.\n\n“The broader shift to ‘clean’ eating has forever changed food industry marketing, sales, share of shelf and online shopping,” said Oyler. “Along the same vein, sustainability has risen to top-priority status. For shoppers, purchasing sustainable foods and products is an investment in their core values. They spend money on brands with circular sustainability strategies for sourcing, production, transportation, packaging and end of life. Success requires a well-orchestrated and holistic approach involving both internal and external stakeholders.”\n\nGetting everyone on board may just be the largest hurdle to overcome when it comes to sustainable packaging.\n\n“Short-term, I think we are on the right path, and I see the industry making significant strides to produce packaging that is as functional and as sustainable as it can be, minimizing the impact to performance and the environment,” said Barlow. “There will be a lot of effort placed in continuous improvement to help with packaging costs, plastics reduction, waste, etc.”\n\nAnd in the long term?\n\n“I personally envision a future where pet food packaging, perhaps a mix of polyolefin-based materials, will be collected curbside and processed through multiple advanced recycling systems,” said Barlow. “The key to realizing this vision lies in industry collaboration. Pet food manufacturers, packaging companies and recyclers must work together to develop the necessary infrastructure and processes that will establish these materials as viable recycling feedstock. By creating these partnerships and systems, we can successfully divert substantial amounts of pet food packaging from landfills and into the circular economy.”",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 4
  },
  {
    "title": "Private label pet food growth beating out name brands",
    "description": "As store brands become more mainstream and consumer perception and cost consciousness collide, the private label space is seeing...",
    "url": "https://www.petfoodindustry.com/pet-food-marketing-and-branding/article/15752886/private-label-pet-food-growth-beating-out-name-brands",
    "date": "2025-10-10T07:05:00+00:00",
    "source_section": "Petfood Industry",
    "sponsors": [],
    "_feed_full_text": "In the U.S., private label — also known as store brands, retailer brands or own brands — is having a moment in terms of growth.\n\nAccording to the Private Label Manufacturers Association (PLMA)’s 2025 Private Label Report, “store brand dollar sales in all outlets increased 4x that of national brands [in 2024] as the products surged ahead by 3.9% compared to a gain of only 1% for their branded counterparts. Looking at unit sales, the head-to-head disparity was much the same. Store brands advanced by 2.3% versus the figure for all of 2023 while national brands dropped -0.6%.”\n\nOverall, that equated to US$270.58 billion in sales for store brands in 2024 (an all-time annual high, according to PLMA’s report), compared to a still dominant US$1.03 trillion for national brands. The numbers speak to the stagnation of branded product growth as private label becomes better understood and, in consumers’ eyes, more equivalent to anything with a well-known logo. In fact, in 2024 one out of every four food and non-food grocery products purchased in the U.S. carried a store’s name or one of its proprietary brands.\n\nPet food in the private label arena\n\nThe pet space is not immune to this shift in purchasing trends, with overall pet care seeing a 1.7% growth in private label dollar sales in 2024 (to US$5.3 billion) and, more sustainably, 3.5% growth in unit sales, according to Cascadia Capital ’s Summer 2025 Pet Industry Overview.\n\n“ Consumer sentiment regarding private label items has warmed in recent years, as perceptions of product quality and nutrition have risen, and factors like convenience and price have become more influential purchase drivers,” said Colton Clason, senior marketing manager for Pet Nutrition at ADM . “Major retailers are investing in private label product lines to own more of the store shelf, encourage consumer trust and loyalty and emphasize exclusivity. Additionally, some store brand packaging is designed with a more premium look and feel to highlight quality and value — not just affordability.”\n\nThe premiumization of own label products may be one of the keys to winning over pet consumers, as they are well-known for not being stingy when it comes to their pets’ nutrition, even during times of economic turmoil.\n\n“Lower-priced options aren’t always the preferred choice,” said Alison Angus, head of innovation for Euromonitor in her January 2025 report, “ What are the top consumer trends of 2025? ” “Even though nearly three in four consumers were concerned about the rising cost of everyday items [in 2024], half were willing to spend money to save time. Factors like quality, convenience and price still influence purchase decisions, but added value is the expectation.”\n\nChallenges and possibilities for private label products\n\nFor all the growth happening in the private label space , there are some challenges the segment will need to overcome if it wants to continue to gain ground on brand names. In 2024, pet care store brands made up 16.5% of total pet care dollars, up 0.2% from 2023, according to PLMA data. In terms of unit share the numbers tell a similar story: a 17.6% share in 2024, up 0.4% from 2023.\n\n“Private label brands aim to emulate an existing product at a lower cost — not identical, to avoid infringing on trademarks or intellectual property, but so close that consumers can’t tell the difference,” said Clason. “This might mean substituting a comparable ingredient with a lower price point, but often cost savings come from cutting out the middleman; that is, purchasing product directly from the manufacturer rather than a national brand. Additionally, private label brands typically don’t rely as much on marketing because consumers are a captive audience; they’re already browsing in the store and they’re familiar with the house brand. They don’t need marketing to be persuaded to purchase an item that’s a close equivalent to a national brand’s product — at a lower price.”\n\nEmulation, rather than innovation, and a captive shopping audience can only take private label so far, especially in pet where there are so many options to choose from. Brand name or not, the product has to stand out in order to be noticed. The combination of lower price and an overall trend towards standing on their own as brand options may be what continues to drive private label pet foods forward.\n\n“Although the pet segment showed initial signs of resilience as prices across the consumer packaged goods (CPG) space rose, consumers eventually hit their breaking point with the rising cost of goods, underpinning recent private label traction,” said Cascadia in its report. “As private label continues to focus and offer products aligned with the latest trends through premiumization, innovation, sustainability and elevated culinary experiences, it is poised to gain share of the overall industry, especially as consumers discover they do not need to meaningfully sacrifice quality to save money.”\n\nThe future of private label in pet\n\n With the global economic stage set for at least medium-term turmoil, it’s not difficult to imagine private label taking on a more significant role in consumers’ shopping habits as time goes on.\n\n“Currently, private label products are created to replicate existing solutions,” said Clason. “They are not typically investing in scientific innovations or novel solutions. This is where name brands differentiate — consumers are willing to pay more for a new and exciting solution, such as pet products with functional ingredients and clinically studied benefits or treats in playful and palatable flavors and aromas. In fact, 77% of global pet owners are willing to pay more for products featuring ingredients that provide functional benefits (ADM Outside Voice, Global Lifestyle Survey 2025). But as the growing need for affordable, quality pet products continues to drive consumer spending habits, the private label segment is likely to redistribute market share, taking a larger piece of the pie, while reducing value growth within the overall pet food category.”",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 4
  },
  {
    "title": "Competitive landscape favors corporate kingpins",
    "description": "The convergence of evolving e-commerce strategies, omnichannel shopping trends and consumer demand for comprehensive solutions...",
    "url": "https://www.petfoodindustry.com/blogs-columns/market-report/article/15752738/the-competitive-landscape-is-favoring-corporate-kingpins",
    "date": "2025-10-10T07:05:00+00:00",
    "source_section": "Petfood Industry",
    "sponsors": [],
    "_feed_full_text": "Packaged Facts projects retail sector sales of pet food and treats (excluding products sold through the veterinary sector) to reach US$70 billion in 2024 — up 4% over 2023, down from COVID pandemic-driven highs of 14% to 16% in 2020 through 2022.\n\nPackaged Facts also projects retail e-commerce sales of pet food/treats to reach US$29 billion in 2025, or 41% of the total, up from 25% in 2019. “ E-commerce sales” are defined as including online and smartphone app (digital) sales; sales of pure play internet retailers (such as Amazon and Chewy); digital sales of brick-and-mortar-based retailers (such as Walmart.com and PetSmart.com); and buy online, pick-up in store (BOPIS) or curbside.\n\nIn-store and e-commerce landscape evolutions\n\nTraditionally store-based retailers claim a portion of e-commerce sales, but it’s a minority share. MRI-Simmons Spring 2025 data show that Amazon and Chewy combined (not counting other pure-play e-commerce websites) draw a 36% share of pet food shoppers. Lining up against the 41% total e-commerce share of pet food/treat sales, that leaves a limited remaining share (about 14%) for traditionally store-based retailers.\n\nWhile in-store continues to account for a majority of total pet food/treat sales, at 59% in 2025, that’s down from 75% in 2019. If the current trend line continues, e-commerce sales should match in-store by the early 2030s.  \n\nTo further fill in the competitive map, the mass market (led by Walmart) leads in brick-and-mortar sales of pet food and treats — at a projected 60% share of in-store sales in 2025, translating to 35% of overall in-store plus e-commerce sales. In turn, brick-and-mortar sales of pet food/treats through pet specialty stores (led by PetSmart and Petco) will account for 27% of in-store pet food/treat sales in 2025, translating to 16% of overall in-store + e-commerce sales.\n\nOmnichannel strategies\n\nBoth in-store vs. e-commerce and mass market vs. pet specialty perspectives, however, can miss the big picture. Pet industry growth is being driven by the “ omnimarket ” strategies of top players, which recognize that pet owner spending has broadened not only across physical and digital retail channels (even including TikTok), but across a transformed set of products, services and high-tech product/service hybrids. Top players aggressively cross former business boundaries to compete for consumer mindshare, customer loyalty and pet care expenditures.\n\nBrick-and-mortar leaders including Walmart, PetSmart and Petco all pursue not simply online/omnichannel but omnimarket strategies. From the e-commerce space, Chewy similarly pursues omnimarket strategies with its venture into veterinary clinics. Mars straddles the pet food manufacturing and veterinary arenas not only through its longstanding ownership of Banfield Pet Hospitals, which are primarily located in PetSmart stores, but through related initiatives such as direct-to-consumer sales of therapeutic pet food through veterinary clinics.\n\nThe growth momentum among top competitors stems not only from multi-pronged strategies and the scale of business resources available, but from customer preference for one-stop shopping — or, more precisely, for having a single main supplier of pet products as well as services.\n\nLarger companies in position to take advantage of “one-stop shop” desires\n\nAs reported by Forbes (February 27, 2025), “Petco’s strategy is rooted in serving as a complete, one-stop shop that caters to all of a pet’s needs, with hands-on services being a clear differentiator from online-only competitors.” PetSmart’s TreatsRewards program, similarly, has as its slogan, “We’re here to help you do Anything for Pets.”\n\nAs shown by Packaged Facts’ January 2025 Survey of Pet Owners, 30% strongly agree that they like the idea of having a single main source for pet care, spanning products and services, with another 36% somewhat agreeing. Moreover, as an indicator of how the landscape has shifted, the percentage who strongly agree is significantly higher among the younger generations — with 40% of both Gen Zers and Millennials strongly agreeing, compared to 25% of Gen Xers and only 19% of Boomers.\n\nIn addition, 29% of pet owners overall strongly agree that they like the idea of having a smartphone app to keep track of pet care, spanning products and services, with another 30% somewhat agreeing. Again, the percentage strongly agreeing jumps among the younger generations — with 38% of Gen Zers and 42% of Millennials strongly agreeing, compared to 26% of Gen Xers and 14% of Boomers.\n\nCorporate kingpins in the general consumer or pet industry, rather than local and independent businesses, are best positioned to gain sales in this environment of one-stop product + services and tech-driven pet care. Factoring in that the number of dog-owning households has been down since 2020, a trend only partially offset by the increasing popularity of cats, gaining sales will mean gaining share.",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 4
  },
  {
    "title": "Life on the shelf",
    "description": "Controlling all available factors from ingredients to final packaging can help ensure that products last as long as they’re supposed...",
    "url": "https://www.petfoodindustry.com/blogs-columns/ingredient-issues/article/15752626/life-on-the-shelf",
    "date": "2025-10-10T07:05:00+00:00",
    "source_section": "Petfood Industry",
    "sponsors": [],
    "_feed_full_text": "“Best By” and “Use By” dates are common communications on any food. We recognize this as the product’s “shelf life,” information by brands to consumers indicating the product is still safe and nutritious to use. Shelf life is also valuable in inventory and turnover management along with the need for a potential recall.\n\nIt’s interesting the typical minimum shelf life length in most pet products is 18 months and in many situations 24 months. I often wonder how old my cereals or cookies are and how I should turn over foods in our pantry more often. It’s common to find off-aromas in sunflower seeds, herbs and spices, or potato chips, or perhaps rapidly growing mold on breads and cheeses.\n\nShelf life is typically defined as the period where a product remains suitable for use or consumption, ensuring quality, efficacy and safety. It’s more than a date. A product does not instantly become different or unusable on this date. Changes to the product over time are rarely a linear event degrading steadily each day. It relies on predictive chemistry plus the viable protection built into the formula or process. Shelf life assesses the paths a product takes and how a consumer might handle or store it.\n\nShelf life considerations begin long before manufacturing, starting with each ingredient's source and how it was processed and protected from rancidity, mold and microbial growth. Ingredients vary significantly in stability: Some have naturally long shelf lives, while others require quick turnover and constant inventory management. Similarly, finished food products range from highly stable to perishable. Understanding how each ingredient affects overall shelf life is critical for developing appropriate protection strategies throughout processing, packaging and storage.\n\nWhat are the challenges?\n\nIngredients undergo multiple processes — drying at various temperatures, stabilization, freezing, slurrying, hydrolysis, blending, spray-drying and freeze-drying — before transport. It is easy to see why shelf life begins here. A properly stable finished food product is dependent upon ingredients made under stable processes. Setting a shelf-life date in a dry food product should vary between products and is best determined following an accelerated protocol where finished packages are put in chambers at 105˚ F and 75% R.H. (relative humidity). Each subsequent sample taken is tested to confirm the control of mold, rancidity and microbial growth. Each week in these conditions is like three weeks in the food pipeline.\n\nThe protocol to determine stability in other products must be developed properly to consider all the potential stresses to the food.\n\nOnce a shelf-life date is chosen, products go through a varied and often unpredictable pathway to the consumer and with the consumer. From processing, the food product leaves on a truck then perhaps another, finally making it to a store, warehouse or shipping container. From one warehouse, it may travel to another and then another, or from store to store, and then finally into a home to be happily eaten by family pets. However, it is often poured into unknown containers (with insecure protection from vermin, temperature or moisture) and held in multiple locations in a home, garage or barn. These new containers may allow easier access and impart other flavors from the plastic, off-odors from the environment, or transfer bacteria if not cleaned and stored properly.\n\nEven freeze-drying, canning and frozen foods have challenges. Freeze-drying is not immune to rancidity and must be properly protected. Some consumers microwave frozen foods in the same way they do their own foods, leading to nutritional losses. Canned and frozen foods are taken out of packages and put on plates and bowls. Immediately the stability is challenged at room temperature before the product becomes microbially unacceptable in a few hours. Storing open frozen or canned foods in a refrigerator causes them to deteriorate like any other high-moisture food and should be thrown away in four to five days according to the U.S. Department of Agriculture ( USDA ).\n\nThese paths to a consumer are about as predictable as the weather. A product could be shipped at subzero temperatures to temperatures like a refrigerator. It’s common to experience shipments in temperatures over 100˚ F to 120˚ F with high humidity and low humidity. Temperatures at the back of a trailer can reach 150˚ F on hot, sunny days. Humidity in a container going across the water can reach 100% R.H., causing running water to form inside. Add active insects, hungry rodents and poor ventilation, and these factors rapidly challenge the shelf-life date chosen.\n\nProper air handling is also critical. Warehouse ventilation can create hot and humid spots for the inventory or sweating alongside a concrete outer wall. Food products should have space around them and should be away from sweating concrete walls. The food should be off a concrete floor, properly wrapped and observed daily. There should be adequate air movement around all the products to stop the development of “dead air.” Without these controls, there can be escalating risk for mold, rancidity, microbial growth and vermin penetration.\n\nWhat can happen to products?\n\nMold growth in products is unhealthy. Molds can create mycotoxins that are harmful to pets. Molds require nutrients to grow — using many of the same nutrients designed in food products for pets. While molds grow more rapidly at higher moisture, molds continue to grow at lower water content (just more slowly).\n\nUnprotected products that are high moisture serve as microbial media for Salmonella , Listeria , Pseudomonas and other bacteria. Higher meat, higher moisture products should be carefully tested to ensure adequate controls are in place to keep these abated. Fats that contain dry material and water can be unexpected media for the growth of Salmonella and other pathogens. The addition of specific acids can help reduce this incidence.\n\nControlling the rancidity of products is complex through the myriad paths described above. Rancidity is an oxidation process where one molecule gives up an electron to another. This happens physiologically and can lead to many health issues. Uncontrolled oxidation can impact food products leading to stale odors or strong plastic aromas.\n\nRancid oils and fats can reduce the stability of many vitamins and other nutrients. The stability of key fatty acids will likely be harmed. If eaten, oxidized lipids in foods can increase oxidative stress. One study showed oxidized lipids negatively impacted growth, antioxidant status and some immune functions of dogs. Numerous studies in young chicks and pigs have shown no growth depression with rancid meat meals or fats of unknown level of rancidity. Obviously, the degree of rancidity and the components created in the rancid process of each product will vary and lead to different health outcomes.\n\nWhat are the solutions?\n\nThe solutions are simple with some products, but difficult with others. Demands for “clean” or “limited” labels may sound nice, but they often are the antithesis to long shelf life. In all cases, we must know what stresses the ingredients we use and control them with the suppliers. Stress testing is a critical step in good food science. It is not enough to guess an ingredient’s shelf life. It is not good enough to purchase antioxidants, mold inhibitors and antimicrobials without knowledge of the content and the proper mechanisms of use.\n\nControlling mold is not only about the choice of a specific mold inhibitor, but also about knowing the water content and controlling the product temperature as it fills the package.\n\nControlling rancidity does not happen by guessing the level of an antioxidant blend nor by using a brand name of antioxidant without knowledge of specific concentrations of antioxidant components. Effective rancidity control requires strategic antioxidant additions at key ingredients and critical process points to minimize oxidation risk over time.\n\nControlling pathogenic bacteria is not only process- and packaging-related but also involves pH and antibacterial type (natural and synthetic).\n\nIn all cases of control, proper distribution throughout the mixture of ingredients is paramount. Cutting off oxygen with a nitrogen flush of packaging can further reduce risk.\n\nChoosing a shelf-life date and communicating proper use and storage to consumers should be carefully considered. In all cases it starts with the development of ingredients and carries through formulation, process, packaging, shipment, storage, transfer and then use in the home.",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 3
  },
  {
    "title": "Petfood Forum Asia returns to Bangkok for 2025 conference",
    "description": "Co-located with Pet Fair South East Asia, the October 29 event will focus on regional market trends and innovations.",
    "url": "https://www.petfoodindustry.com/news-newsletters/petfood-forum-news/article/15752320/petfood-forum-asia-returns-to-bangkok-for-2025-conference",
    "date": "2025-10-10T07:05:00+00:00",
    "source_section": "Petfood Industry",
    "sponsors": [],
    "_feed_full_text": "Petfood Forum Asia 2025 , scheduled for October 29 in Bangkok, Thailand, and part of Pet Fair South East Asia, will focus on pet food innovations and regional market trends, providing attendees access to key decision-makers, thought leaders and suppliers in the Southeast Asian market.\n\n\"It's a thrill to have Petfood Forum back in Bangkok to once again connect with the pet food industry in this region while continuing the partnership with Pet Fair South East Asia,\" said Steve Akins, executive vice president, publisher, global petfood and events at WATT Global Media. Akins emphasized the event's role in presenting region-specific trends while introducing cutting-edge technologies to the rapidly expanding Southeast Asian pet food sector.\n\nThe conference serves as a strategic complement to Pet Fair South East Asia, according to Johannes C. Kraus, project manager at the trade show. \"Petfood Forum Asia is an important add-on to the fair and will provide an additional forum for in-depth discussions, allowing participants to expand their knowledge on the latest research available for manufacturing pet food and treats,\" Kraus noted.\n\nIndustry professionals interested in attending can find registration details and additional information online at petfoodforumevents.com/asia .\n\nPetfood Forum Asia agenda\n\n10:30-11:30 Check-in/registration and coffee/tea/snack\n\n11:30-12:30 Welcome and opening session: Global and Asian pet food market update and trends\n\nSahiba Puri , senior consultant, pet care, for Euromonitor International, will provide an overview of current pet food performance globally and in Asia-Pacific, including growth drivers and category insights. She will discuss key regional trends covering channel dynamics, premium product push, and preventive health management. Using data and case studies, Puri will forecast future performance and highlight market opportunities.\n\n12:30-13:30 Lunch\n\n13:30-14:10 Stability of marine microalgae oil during pet food extrusion, retort and long-term storage\n\nShiguang Yu, Ph.D., MBA, global director, pet nutrition and applications, for DSM-Firmenich, will explain the stability of DHA and EPA in sustainable marine microalgae oil in both dry and wet pet foods. He will cover stability during extrusion, retort processing and long-term storage under various conditions.\n\n14:10-14:50 Pet food formulation quality and risk management\n\nIan Mealey, product marketing director for formulations for Format Solutions, will discuss implementing quality control programs within formulation software to ensure consistent product quality. He will address challenges like ingredient variability and supply chain disruptions while introducing automated risk assessment technologies. The focus will be on formalizing expert knowledge to help manufacturers cost-effectively produce reliable quality products.\n\n14:50-15:30 Coffee break\n\n15:30-16:10 Postbiotics: Unlocking new clinically backed pet health benefits\n\nAdrian Kerester, senior director of growth, and Ravi Sheth, Ph.D., co-founder and chief science officer, for Kingdom Supercultures, will explore how postbiotics meet Asian pet owners' demand for products with noticeable health benefits. They will cover market insights, consumer-relevant outcomes, and case studies on clinically validated oral and immune postbiotics. Practical considerations including clinical evidence, formulation constraints, and stability will be discussed.\n\n16:10-16:50 Reducing waste in pet treat extruder production\n\nPaul Mortlock, managing director and CEO, and Steve Plas, strategy director, for Frazer-Nash Manufacturing, will examine overlooked waste sources in pet treat extrusion including scrappage and overweight giveaway. They will focus on minimizing systematic waste through better extruder output control to achieve cost savings and improved efficiency. Key solutions examined will include mechanical controls without requiring individual flow restrictors or manual intervention.\n\n17:00-19:00 Pet Fair South East Asia Networking reception\n\nOctober 30, 2025 19:00-23:00 Pet Fair South East Asia Sky Bar Reception – Bangkok\n\nRegistration details\n\nPetfood Forum Asia registration includes five educational presentations, a networking coffee break and lunch. Plus, access to two networking receptions included with the Pet Fair South East Asia 2025 registration. There is no cost to attend Pet Fair South East Asia.",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 3
  },
  {
    "title": "Buddy Bites’ goal: Feed all shelter dogs in Asia",
    "description": "A company that launched with a mission in mind continues to grow in the premium pet food space.",
    "url": "https://www.petfoodindustry.com/pet-food-market/pet-food-company-profiles/article/15752233/buddy-bites-goal-feed-all-shelter-dogs-in-asia",
    "date": "2025-10-10T07:05:00+00:00",
    "source_section": "Petfood Industry",
    "sponsors": [],
    "_feed_full_text": "Buddy Bites is based in Hong Kong with European-made dog food, giving this multinational company a unique perspective on both quality and consumers.\n\n“We provide a premium product that the modern consumer demands while demonstrating an ethical approach that they can feel good about,” says Buddy Bites co-founder Chris Lee. “Most of the incumbents in the space have not evolved over the past 30 to 40 years, but the consumer has. Millennials and Gen Z are taking up a far larger portion of the market, changing what it means to be a pet parent, yet hardly any brands in Asia cater to this cohort. If we continue to provide high-quality nutrition and great customer experience, we trust retention will remain strong.”\n\nPhilanthropy: For every 2kg sold, 1kg donated\n\nAs with any newer company (Buddy Bites was founded in 2020), attracting new customers to try the product is key. Buddy Bites has found their niche in being charitably forward.\n\n“Everything we see points toward the giving-back component as the catalyst for pet owners,” says Lee. “It gives people a reason to try us. Beyond that, we are confident in the food and the service to keep them as happy, loyal customers.”\n\nIn fact, Buddy Bites launched as a philanthropic mission.\n\nBuddy Bites has both puppy and adult formulations, focusing on premium European ingredients, high-quality protein sources and prebiotics.  Buddy Bites\n\n“The company started as a philanthropic side gig that Ryan (co-founder Ryan Black) and I were juggling with our full-time jobs,” says Lee. “We now have a phenomenal team of 10 split across Hong Kong and Singapore. The days of Ryan and me heading out to do the deliveries ourselves on a Saturday, really testing the suspension of my secondhand car with 300kg-plus of dog food in the boot and back seats, seem a long time ago!”\n\nThe message seems to have gotten to the company’s customers in a big way: 50% of the Buddy Bites’ customers from the first month of business in 2020 are still loyal customers to this day, and the company’s monthly churn is below 3%.\n\n“Our giving back component is certainly what separates us from other brands,” says Lee. “For every 2kg we sell, we donate 1kg to dog shelters. The monthly donation total is now more than 14 tons. I can’t think of another brand that does that. I think the effective part of this mechanism is that we don’t view it as Buddy Bites donating, we see ourselves as a platform for our customers to donate through. The 2-for-1 is so simple and transparent, you know that when 10kg of your own food arrives at your door you have donated 5kg to a shelter. I think that resonates.”\n\nEven as the company has grown, the brand’s core has remained the same.\n\n“We are still a brand focused on quality, in both product and service, giving back to the shelter community and having as much fun as possible along the way,” says Lee. “I think that if you have strong core values and you hire people that genuinely buy into them, it’s a lot easier to maintain the brand ethos.”\n\nDifferentiation and expansion\n\nBuddy Bites has striven to provide something different to its Asian consumers, standing out among other domestic brands and imports.\n\n“We offer a different product and service to other brands you find in Asia,” says Lee. “On the nutrition side, every recipe is formulated by pet nutritionists and our in-house vet. We use fresh, single proteins as our first ingredient alongside superfoods, premium carbohydrates and our Buddy Bites prebiotic blend to boost gut health. Our approach to nutrition alone puts us in the premium category.”\n\nCurrent formulas include proteins such as chicken, turkey, duck, salmon and lamb.\n\n“We also offer a convenient service, with orders placed through our website, the option of a one-time purchase or a discounted subscription set up, which helps you to never run out of food again,” says Lee. “We deliver to your door, personalize the food bags with your dog’s name, and include a welcome box full of treats for both pup and parent. If there is ever a problem or delay, which can happen, our customer service team (no bots!) is available via email and WhatsApp, and I guarantee prompt solutions to any issue. The business is built around our three pillars — nutrition, convenience and giving back — and my belief is that it’s the combination of all three that really makes us stand out.”\n\nBuddy Bites’ co-founders must be on to something, because the company has grown 100% year-on-year for the last three years, despite Lee and Black keeping their marketing spend below 15% of revenue.\n\n“We have consistently expanded our dry food offerings, with Fresh Turkey & Sweet Potato being our most recent recipe added, but the standout addition to our portfolio in the last 12 months has been our New Zealand-made, air-dried treats,” says Lee. “We offer two recipes — Beef & Blueberries and NZ Chicken & Manuka Honey. They are a jerky consistency and have been incredibly popular. We are a dry food brand first and foremost but expecting a new — or potential — customer to change their dog’s diet on their first interaction with the brand is ambitious. Treats are obviously more of an impulse buy and a nice way to spoil your dog. So, they have been a fantastic addition for introducing Buddy Bites to new customers, who then take a closer look at our range of offers. We are going to be adding a new air-dried treat flavor late this year, or early next.”\n\nBuddy Bites’ puppy recipe has a trio of proteins (chicken, pork and salmon) as well as ingredients focused on providing everything a growing dog needs to stay healthy.  Buddy Bites\n\nKnown up until now as a dog brand, Buddy Bites is also getting on board the cat train.\n\n“We are also very excited to launch our cat food range in late 2025,” says Lee. “Cat is actually the larger market in both Hong Kong and Singapore, which surprised me at first. I think launching our cat food range is a huge opportunity for us. Having surveyed our existing customers, we know that 20% of them already have a cat in their home and our retail partners are all keen to stock our cat food products. If we can see anything like the success we have seen early in dog, then we have a lot to be excited about.”\n\nChallenges and what’s next for Buddy Bites\n\nThe logistics of producing pet food in Europe for sale in Asia aside, finances have been the most difficult part of getting Buddy Bites off the ground and sustainable.\n\n“It has been a tough environment to raise capital over the last year or two,” says Lee. “I’m sure that we are not the only ones to experience this, but it has certainly taken a lot of time and energy from Ryan and me when we would much prefer to be focused on growing the business. Asia is an interesting proposition; as a collective it is a huge market with a rapidly growing pet food sector, yet it is not seen as large enough to attract some of the more established brands from the U.S. and Europe, meaning that there are few success stories within direct-to-consumer (DTC) pet. Through the LEAP program (Buddy Bites was invited onto the 2024/25 cohort of the LEAP Venture Studio accelerator program, backed by Mars and The Michelson Foundation), though, we have been introduced to several U.S.- and EU-based funds who all agree it’s only a matter of time before a challenger brand replicates the growth of one of the success stories in the West. This sentiment allowed us to successfully close our seed round during a very difficult time to raise capital.”\n\nBuddy Bites is finding success from both the DTC and retail angles while continuing its philanthropy focus.\n\n“We are now on shelf in the largest pet stores in both Hong Kong (QPets) and Singapore (Pet Lovers Centre),” says Lee. “We have also just gone past the ‘8 million meals donated’ milestone!”\n\nOne of the biggest trends helping Buddy Bites is pet humanization, which has reached out from the more mature markets to hit every corner of the pet food space.\n\n“I think that the trend of humanization in dog food will only continue,” says Lee. “It’s incredible to see the popular talking points from human food work their way into pet food five years later. Superfoods, collagen, supplements in general. We think that the supplements space will be very exciting, and we are launching functional treats to try and drive that excitement in our markets.”\n\nAccording to Lee, innovation will keep the industry moving forward.\n\n“We are really happy to see so many fantastic challenger brands out there,” says Lee. “There is so much innovation in the space, and modern consumers seem far more conscious of nutrition and social impact, which drives brands to be better. It also seems to be recession proof. If people are watching their outgoings, I think they are more willing to reduce spend on themselves rather than their pets. It’s a very exciting time to be working in the pet food industry.”",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 3
  },
  {
    "title": "Why Brazil continues to rise in pet food and pet care",
    "description": "The second largest market globally in pet food volume production, with robust export sales, Brazil still has room to grow even...",
    "url": "https://www.petfoodindustry.com/blogs-columns/something-to-chew-on/article/15752224/why-brazil-continues-to-rise-in-pet-food-and-pet-care",
    "date": "2025-10-10T07:05:00+00:00",
    "source_section": "Petfood Industry",
    "sponsors": [],
    "_feed_full_text": "Like many economies and pet food markets today, Brazil is experiencing some ups and downs . Abinpet , the Brazilian Association of the Pet Products Industry, projects the overall pet care sector to grow 3.5% in sales in 2025. While this is the lowest growth rate since 2019, signifying some headwinds even in a dynamic, developing market, it’s a number many other countries and sectors would envy.\n\nThe Brazilian pet food market has many bright spots and so much potential: In 2024, it ranked second globally in pet food volume production, and that’s with significant room to grow; currently, commercial pet food has only 45% penetration in the country’s households. In addition, pet care exports increased 29% in 2024, with pet food and treats accounting for 86% of the market’s US$500 million exports. (Abinpet produced and released this data in partnership with the Pet Brazil Institute.)\n\nI was fortunate to visit Brazil last year at Abinpet’s invitation to see three pet product companies in and near São Paulo. Two were in segments other than pet food: Pet Society offers grooming products and Vetnil specializes in pet and equine medications and supplements. I was struck by how many similarities in strategy and operations they shared with the third company, Adimax , a large pet food producer, and how those mirror what’s happening in other markets:\n\nAll three companies lean heavily on pet humanization, just as most other pet product companies around the world do, balanced by scientific research on what’s best for the pets;\n\nAll were started by entrepreneurs who saw a market opening or didn’t see the type of products they thought pets deserved;\n\nAll are relatively young, founded in the past 20 to 30 years, and growing quickly: 20% to 30% a year for Vetnil (its business switched from 50% pets/50% equine pre-pandemic to 70/30 now, due to the growing popularity of pets), with the opening of a new headquarters and plant to accommodate the expansion. Adimax opened a new processing facility in June 2024 while also expanding its main facility at its headquarters;\n\nQuality and safety are key for all three companies, with rigorous protocols and standards (and spotless factories);\n\nOther shared values include innovation, sustainability, employee respect and wellness (all have cafeterias offering free lunch daily for all staff) and commitment to social causes.\n\nAs this issue goes to press, I will again be traveling to São Paulo to attend Pet South America and host two seminars under our new Petfood Forum Brasil initiative: an update on the Brazilian pet food market by José Edson Galvão de França, executive president of Abinpet, and an overview of the latest pet food research in the country by Fabiano Cesar Sa, DVM, Ph.D., R&D manager for Adimax.\n\nWe’ll be reporting on their sessions and insights, along with other observations from Pet South America and the Brazilian market. The expectation is that the country will readily weather any economic storms thanks to the growing love for, and care of, pets there.\n\nBrazilian pet food company gives back\n\nwww.PetfoodIndustry.com/15704383/",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 3
  },
  {
    "title": "Avanti Pet Care introduces dog food",
    "description": "The launch marks the company’s entrance into the dog food market.",
    "url": "https://www.petfoodprocessing.net/articles/19756-avanti-pet-care-introduces-dog-food",
    "date": "2025-10-10T12:00:00+00:00",
    "source_section": "Pet Food Processing",
    "sponsors": [],
    "relevant": true,
    "relevance_score": 4
  },
  {
    "title": "More Shoppers Say a Poor Return Experience Can Deter Future Purchases",
    "description": "The National Retail Federation and Happy Returns reports on behaviors surrounding returns.",
    "url": "https://petsplusmag.com/more-shoppers-say-a-poor-return-experience-can-deter-future-purchases/",
    "date": "2025-10-16T00:42:15+00:00",
    "source_section": "Pets+ Magazine (Headlines)",
    "sponsors": [],
    "_feed_full_text": "Retailers estimate that 15.8% of their annual sales will be returned this year, totaling $849.9 billion, according to the 2025 Retail Returns Landscape report just released by the National Retail Federation and Happy Returns, a UPS company. That’s down from 16.9% last year, when returns totaled $890 billion.\n\nWhile overall return rates may remain steady, some areas are facing more pressure than others. For instance, an estimated 19.3% of online sales will be returned in 2025. Additionally, as Gen Z’s influence grows, so does their impact on returns. Those between the ages of 18 and 30 made 7.7 returns of online purchases in the last 12 months, on average, more than any other generation.\n\nThe study also found consumer expectations are increasing around returns. Free returns are a major draw for shoppers, with 82% citing them as a major consideration when making a purchase, up from 76% last year. Consumers also value immediacy, with 76% saying they are more likely to choose a return option that provides an instant refund or exchange.\n\nStill, a poor returns experience can deter future purchases. About 71% of consumers say they are less likely to shop with a retailer again after a poor experience, up from 67% in 2024. And four out of five said they will share their negative experience with friends and family, potentially amplifying the impact.\n\n“Returns are no longer the end point of a transaction,” NRF Vice President of Industry and Consumer Insights Katherine Cullen said. “They provide an opportunity for retailers to create a positive experience for customers and can translate to brand loyalty. Retailers are constantly evolving and working to meet customer expectations, and they recognize the importance the returns process plays.”\n\nNRF and Happy Returns, a UPS company, conducted two surveys this summer to understand the dynamics of online returns from both consumers and ecommerce professionals. The first survey included responses from just over 2000 consumers who had returned at least one online purchase within the past 12 months. The second survey engaged 358 professionals involved in ecommerce for large (over $500 million in revenue) U.S. merchants.\n\nClick here for access to the full report.",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 3
  },
  {
    "title": "Tariffs May Play Grinch: Survey",
    "description": "Holiday shoppers worry about merch’s price and availability.",
    "url": "https://petsplusmag.com/tariffs-may-play-grinch-survey/",
    "date": "2025-10-14T02:25:42+00:00",
    "source_section": "Pets+ Magazine (Headlines)",
    "sponsors": [],
    "_feed_full_text": "Visions of empty shelves and higher price tags for goods that are in stock are dancing in the heads of shoppers planning their spends for this year’s holiday season, finds a new survey of 1000 American consumers by o9, an enterprise AI software platform.\n\nHere are some major results from the survey, which was performed in conjunction with Team Lewis:\n\n45% of those surveyed are extremely concerned or very concerned about global trade issues affecting their ability to find the products they want to purchase during the upcoming holidays.\n\nAcross the board, about one out of five Americans said they have not recently purchased a product they need or want from the following categories due to the current economic climate: clothing (24%), groceries (22%), and electronics (21%).\n\nWhen they do make a purchase, 75% of Americans agree that they are more likely to buy based on a need and 55% will usually wait until the product is on sale.\n\nRegarding overall holiday spend, nearly one in three (32%) of survey respondents said they plan to cut back due to tariffs or trade restrictions, while 31% indicated they will switch to lower-cost brands or products.\n\nMore than two in five (42%) of Americans said quality or durability would make them purchase a more expensive item from one brand over one that’s less expensive from another brand.\n\n“Tariffs in their current form are being used more unpredictably and aggressively than in decades past, and our new shopper spotlight survey reflects the impact of that among American consumers,” said Adam Ben-Yousef, o9’s SVP, Revenue Growth Management. “Despite today’s uncertain economic environment, brands that can connect pricing, promotions and portfolio strategy with real consumer behavior are better equipped to navigate tariff volatility with clarity and control. With the right data, tools and collaboration in place, companies can make smarter tradeoffs, strengthen brand equity and deliver value in ways that last far beyond the 2025 holiday season, regardless of what the market throws their way.”\n\nClick here for more from the o9 survey, which was fielded in Aug. 18-22.",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 3
  },
  {
    "title": "Raw Bistro Pet Fare Voluntarily Recalls Frozen Beef Entrée Due to Possible Salmonella",
    "description": "The recall affects products shipped directly to consumers and to distributors in four states.",
    "url": "https://petsplusmag.com/raw-bistro-pet-fare-voluntarily-recalls-frozen-beef-entree-due-to-possible-salmonella/",
    "date": "2025-10-13T16:21:34+00:00",
    "source_section": "Pets+ Magazine (Headlines)",
    "sponsors": [],
    "_feed_full_text": "Editor’s note: When a company announces a recall, market withdrawal or safety alert, the FDA posts the company’s announcement as a public service. PETS+ shares this information with our readership.\n\nOn Oct. 9, Raw Bistro Pet Fare announced a voluntary recall of its Frozen Beef Entrée because of possible Salmonella contamination. The recall affects products distributed directly to consumers and to select distributors Sept. 1-17, 2025, in California, Colorado, Illinois and Minnesota.\n\nAdvertisement\n\ngoogletag.cmd.push(function() { googletag.display('div-gpt-ad-1536009390978-0'); });\n\nThe announcement reads in its entirety:\n\nOctober 9, 2025 – Raw Bistro Pet Fare, Cannon Falls, MN is voluntarily recalling two product sizes of its frozen beef dog food because they may be contaminated with Salmonella.\n\nSalmonella can affect animals eating contaminated products and poses a risk to humans from handling such products, especially if they have not thoroughly washed their hands after contact with the food or any surfaces exposed to it.\n\nHealthy people infected with Salmonella should monitor for symptoms including nausea, vomiting, diarrhea (which may be bloody), abdominal cramping, and fever. In rare cases, infection can lead to more serious conditions such as arterial infections, endocarditis, arthritis, muscle pain, eye irritation, and urinary tract symptoms. Consumers showing these signs after contact with the recalled product should seek medical advice.\n\nPets infected with Salmonella may be lethargic, have diarrhea or bloody diarrhea, fever, or vomiting. Some pets may experience only decreased appetite, fever, and abdominal pain. Infected but otherwise healthy pets can be carriers and transmit infection to other animals or humans. If your pet has consumed the recalled product and shows these symptoms, contact your veterinarian.\n\nThe affected lot was distributed direct to consumer and to select distributors between September 1 and September 17, 2025 in California, Colorado, Illinois, and Minnesota. The products are sold frozen in sealed packaging.\n\nThe recall applies to the following products:\n\nRaw Bistro Dog Fare Grass-Fed Beef Entrée, Frozen – 3 lb bags (UPC 858833002247) Lot 239, Best By 08/27/2026.\n\nRaw Bistro Dog Fare Grass-Fed Beef Entrée, Bulk, Frozen – 18 lb cases (UPC 858833002629) Lot 239, Best By 08/27/2026.\n\nBoth of the above products have a “Best By” date of 08/27/2026 and lot number 239 printed on the packaging near the bottom of the back of the bag or box.\n\nCause of Recall and Testing Background\n\nThe potential for contamination was identified after an FDA-collected sample from a distributor tested positive for Salmonella. To date, no illness of pets or humans related to this lot has been reported.\n\nConsumer Instructions\n\nIf you have the recalled product:\n\nDo not feed it to pets or any other animals.\n\nDo not sell or donate the recalled product.\n\nClean and sanitize pet food bowls, scoops, utensils, storage containers, and any surfaces that may have come into contact with the product.\n\nWash hands thoroughly after handling pet food or any surfaces exposed to the food.\n\nConsumers who purchased the recalled product should return it to the place of purchase for a refund on any remaining product or dispose of it in a way that prevents access by children, pets, or wildlife.\n\nIf you have any questions, please email us at hello@rawbistro.com or call/text us at (507) 291-3153 between 8:00 am – 4:00 pm Monday to Friday CST.\n\nThis recall is being conducted voluntarily and in coordination with the U.S. Food and Drug Administration.\n\nCompany Contact Information\n\nConsumers:\n\nRaw Bistro Pet Fare\n\n(507) 291-3153\n\nhello@rawbistro.com",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 4
  },
  {
    "title": "Foodynamics Voluntarily Recalls Freeze-Dried Pet Treats Due to Possible Salmonella Contamination",
    "description": "Raw Dog Barkery, BellePepper Cats and Kanu Pets Brand are included in the recall.",
    "url": "https://petsplusmag.com/foodynamics-voluntarily-recalls-freeze-dried-pet-treats-due-to-possible-salmonella-contamination/",
    "date": "2025-10-12T22:49:20+00:00",
    "source_section": "Pets+ Magazine (Headlines)",
    "sponsors": [],
    "_feed_full_text": "Editor’s note: When a company announces a recall, market withdrawal or safety alert, the FDA posts the company’s announcement as a public service. PETS+ shares this information with our readership.\n\nOn Oct. 9, Foodynamics announced a voluntary recall of its Raw Dog Barkery, BellePepper Cats and Kanu Pets brand freeze-dried pet treats because of possible Salmonella contamination. The recall affects products shipped from Wisconsin via UPS to retailers in Wisconsin, New York and Florida. A total of seven packages were distributed to consumers in these areas.\n\nThe release reads in its entirety:\n\nWales, WI — Foodynamics is voluntarily recalling specific lots of Raw Dog Barkery, BellePepper Cats, and Kanu Pets brand freeze dried pet treats because they have the potential to be contaminated with Salmonella. Salmonella can affect animals eating the products and there is risk to humans handling contaminated pet products, especially if they have not thoroughly washed their hands after contacting the products or any surfaces exposed to the products.\n\nHealthy people infected with Salmonella should monitor themselves for the following symptoms: nausea, vomiting, diarrhea or bloody diarrhea, abdominal cramping and fever. Rarely, Salmonella can result in more serious ailments, including arterial infections, endocarditis, arthritis, muscle pain, eye irritation, and urinary tract symptoms. Consumers exhibiting these signs after having contact with infected products should contact their healthcare providers.\n\nPets with Salmonella infections may be lethargic and have diarrhea or bloody diarrhea, fever, and vomiting. Some pets will have only decreased appetite, fever and abdominal pain. Infected but otherwise healthy pets can be carriers and infect other animals or humans. If your pet has consumed the recalled product and has these symptoms, please contact your veterinarian.\n\nThe recalled products were shipped from Wisconsin via UPS to retailers in Wisconsin, New York, and Florida. A total of 7 packages were distributed to consumers in these areas.\n\n4 recalled Raw Dog Barkery products were packaged in 3 oz. and 16 oz. (1 lb.) packages and the “Use By” date (also the Lot #) is printed on a sticker on the back label of the packaging. Labels below. These products were distributed SimplyDried Treats, Magpies Gourmet Dog Treats, and What’s In the Bowl Delafield in Wisconsin.\n\n2 packages of recalled BellePepper Cats products were sold by the retailer in New York in 3 oz. packaged plastic bags labeled “Freeze Dried Chicken Heart Slices” with a “Use By” sticker on the back listing 031627. Recalled products from Use By / Lot #’s 121426 and 011526 may have also been included in samples offered by the retailer as freeze dried pet treats. Labels below.\n\n1 package of recalled Kanu Pets products was sold by the retailer in Florida in a 3 oz. packaged plastic bag labeled “Freeze Dried Chicken Heart Raw treats” and had a Use By / Lot # sticker on the back label of 031627. Labels below.\n\nFoodynamics successfully traced 100% of the product distribution within hours of the recall notice and has contacted all direct customers. No adverse health effects have been reported in pets or humans to date.\n\nThe recall is the result of FDA sampling which revealed the presence of Salmonella. Foodynamics has ceased the production and distribution of the product while it works with the FDA to continue its investigation into what caused the problem.\n\nThe affected Raw Dog Barkery Treats for Cats and Dogs Freeze Dried products include:\n\nThe affected BellePepper Cats products include:\n\nThe affected Kanu Pets product include:\n\nFoodynamics is in contact with all retailers that have purchased these products and instructed them to immediately examine inventory and quarantine all product subject to the recall. Retailers will receive a refund for all recalled products. Consumers are urged to immediately return recalled product to the place of purchase for a full refund.\n\nDo not feed the recalled product to pets or any other animals. The product should be disposed of in a way that children, pets, and wildlife cannot access it. Do not sell or donate the recalled products. Wash and sanitize pet food bowls, cups, and storage containers. Always ensure you wash and sanitize your hands after handling recalled food along with any utensils and surfaces that come in contact with recalled food or treats.\n\nFor more information or any questions, contact Teresa Perry at info@foodynamics.com or call (262) 421-5339, Monday- Friday 9 AM to 5 PM CST.\n\nCompany Contact Information\n\nConsumers:\n\nFoodynamics\n\n(262) 421-5339\n\ninfo@foodynamics.com\n\nAdvertisement\n\ngoogletag.cmd.push(function() { googletag.display('div-gpt-ad-1536009390978-1'); });\n\nAdvertisement\n\ngoogletag.cmd.push(function() { googletag.display('div-gpt-ad-1536009390978-0'); });",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 4
  },
  {
    "title": "Shoppers Took a Breather in September",
    "description": "But overall retail sales remained resilient, CNBC/NRF find.",
    "url": "https://petsplusmag.com/shoppers-took-a-breather-in-september/",
    "date": "2025-10-10T02:04:21+00:00",
    "source_section": "Pets+ Magazine (Headlines)",
    "sponsors": [],
    "_feed_full_text": "Retail sales slowed on a monthly basis in September after a busy summer, but year-over-year increases remain strong as retailers prepare for the holiday season. Those findings headline the latest CNBC/NRF Retail Monitor, powered by Affinity Solutions.\n\n“Retail sales dipped in September as consumers hit the pause button after two solid months of back-to-school spending,” NRF President and CEO Matthew Shay said. “Amid continued economic uncertainty, consumers opted to preserve spending power in preparation for the important holiday season. While month-over-month spending data has fluctuated as consumers have reacted to changing circumstances, year-over-year gains show robust growth and signal momentum as we head into the holidays.”\n\nThe report showed September sales were up in all but one category on a yearly basis, led by digital products, sporting goods stores and clothing stores, but were down in five out of nine categories on a monthly basis.\n\nHere’s a breakdown of each of those sectors:\n\nBuilding and garden supply stores were up 0.53% month over month seasonally adjusted but down 1.2% year over year unadjusted.\n\nClothing and accessories stores were down 1.06% month over month seasonally adjusted but up 7.35% year over year unadjusted.\n\nDigital products (such as electronic books and games) were up 0.52% month over month seasonally adjusted and up 21.35% year over year unadjusted.\n\nElectronics and appliance stores were down 0.12% month over month seasonally adjusted but up 4.43% year over year unadjusted.\n\nFurniture and home furnishings stores were down 1.87% month over month seasonally adjusted but up 0.56% year over year unadjusted.\n\nGeneral merchandise stores were down 0.62% month over month seasonally adjusted but up 5.52% year over year unadjusted.\n\nGrocery and beverage stores were down 0.76% month over month seasonally adjusted but up 4.79% year over year unadjusted.\n\nHealth and personal care stores were up 0.38% month over month seasonally adjusted and up 4.65% year over year unadjusted.\n\nSporting goods, hobby, music and bookstores were up 0.74% month over month seasonally adjusted and up 8.81% year over year unadjusted.\n\nClick here for more from the new Retail Monitor, which uses anonymized credit and debit card purchase data compiled by Affinity Solutions and does not need to be revised monthly or annually.",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 2
  },
  {
    "title": "PetAg Partners With Shelters United to Support Animal Welfare Organizations Nationwide",
    "description": "Members will receive exclusive discounts and benefits, making high-quality care for animals more accessible.",
    "url": "https://petsplusmag.com/petag-partners-with-shelters-united-to-support-animal-welfare-organizations-nationwide/",
    "date": "2025-10-15T21:08:20+00:00",
    "source_section": "Pets+ Magazine (Press Releases)",
    "sponsors": [],
    "_feed_full_text": "(PRESS RELEASE) HAMPSHIRE, IL — PetAg , a trusted leader in premium pet nutrition and wellness, announced a new partnership with Shelters United, a national organization supporting animal welfare groups with essential supplies, education, and resources. The initiative represents an exciting step in PetAg’s ongoing mission to empower shelters and rescues nationwide, enhance animal health and well-being, and make high-quality products more accessible.\n\nThrough the partnership, PetAg will provide Shelters United members with exclusive benefits and discounts on its lineup of products, including milk replacers, nutritional supplements, and other essential wellness items. The program also includes an integrated marketing campaign, engaging Shelters United’s member network with educational resources on product use and best practices, further reinforcing PetAg’s commitment to supporting animal welfare organizations across the country.\n\n“Partnering with Shelters United allows us to advance PetAg’s mission of making premium wellness and nutrition products more accessible to shelters and rescues nationwide,” said Vincent Biroscak, General Manager at PetAg. “By offering exclusive member discounts and educational resources, we look forward to helping these organizations maximize their impact and provide the best possible care for the animals they serve.”\n\n“At Shelters United, our goal is to help animal welfare organizations fulfill their calling to heal, rehabilitate, and adopt out healthy pets,” said Tali Thomas, Shelter United’s Chief Operating Officer. “We partner with companies that share our belief that every animal awaiting adoption deserves access to quality care. PetAg’s commitment to supporting shelters and rescues through education and high-quality, affordable products aligns directly with our mission to make life-saving resources more accessible nationwide.”\n\nTo kick off the partnership, Shelters United members will receive 20% off PetAg’s best-selling milk replacers for kittens and puppies, including KMR Kitten Milk Replacer and Esbilac Puppy Milk Replacer.\n\nFor more information, visit www.petag.com and www.sheltersunited.com .\n\nAbout PetAg, Inc.\n\nPetAg is a trusted leader in pet nutrition and wellness, offering science-backed milk replacers, nutritional supplements, and grooming products that support proactive health across every life stage. Proudly 100% employee-owned and based in Hampshire, Illinois, PetAg has delivered uncompromising quality since 1930. With a legacy rooted in innovation—beginning with Esbilac, the first commercially prepared puppy milk replacer—PetAg is now the #1 brand in newborn kitten and puppy nutrition. Our portfolio includes beloved brands like KMR, Esbilac, GME, Dyne, Cat-Sip, Fresh ‘n Clean, and Bene-Bac, trusted by generations of pet parents and professionals alike.\n\nBacked by over 83,000 five-star reviews online, PetAg is more than a product provider—we’re a partner in pet wellness. Our purpose is to empower pet owners to proactively enhance the lives of their animals, helping them enjoy more healthy, happy years together. Every product we make reflects that commitment, combining proven science, purposeful ingredients, and a passion for pets. PetAg is a subsidiary of PBI-Gordon Companies.\n\nAbout PBI-Gordon Companies\n\nPBI-Gordon Companies has been in business in the Kansas City metro area since 1947 and is 100 percent employee-owned. It is the parent company to four subsidiaries which develop, manufacture, and market leading products for Turf and Ornamental Industries (PBI-Gordon Corporation), Companion Animal Pharmaceuticals (Pegasus Laboratories & TriviumVet), and Companion Animal Nutritional Supplements and Grooming Supplies (PetAg).\n\nAbout Shelters United\n\nShelters United helps animal welfare organizations save money on essential supplies, earn revenue through creative partnerships, and gain knowledge to improve operations. We were created to provide valuable savings and resources to animal welfare groups across the nation.\n\nWith free membership, organizations gain access to four programs:\n\nVet Supplies Savings Program: Our flagship program offers everyday discounts and special offers on pharmaceuticals, vaccines, pest prevention & more.\n\nPet Supplies Marketplace: An online shop for essentials like pet food, litter, diagnostics, enrichment, and valuable clearance sales.\n\nVeterinarian of Record Education Program: Aims to help organizations build and maintain impactful relationships with veterinarians with a free Toolkit and CE course.\n\nShelters United Pharmacy: A mission-driven online pet pharmacy that offers great prices to adopters, staff, and volunteers, while also donating a portion of every purchase back to our member organizations.",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 3
  },
  {
    "title": "RAWZ Expands Sales Team With New Territory Managers",
    "description": "Strategic hires fuel continued growth and strengthen partnerships with independent retailers nationwide.",
    "url": "https://petsplusmag.com/rawz-expands-sales-team-with-new-territory-managers/",
    "date": "2025-10-15T20:52:27+00:00",
    "source_section": "Pets+ Magazine (Press Releases)",
    "sponsors": [],
    "_feed_full_text": "(PRESS RELEASE) YORK, ME — RAWZ Natural Pet Food, a family-owned company dedicated to providing minimally processed nutrition for dogs and cats while giving back to those in need, announced the addition of two new members to its growing sales team. Annette Flood has joined as Midwest Territory Manager and Teresa Rubio has been named West Coast Territory Manager.\n\nAnnette brings more than 20 years of pet industry experience, having held a variety of roles spanning customer service and sales for distribution and manufacturing, as well as buying for a 133-store retail chain. Her diverse background gives her a broad perspective of the industry, allowing her to connect with both retailers and distribution partners on a personal and professional level. Based in central Illinois, Annette will oversee the Midwest region, strengthening partnerships with independent pet retailers and helping them succeed with RAWZ’s line of nutrient-rich pet foods.\n\nOutside of work, she and her husband live on a small farm where they raise market sheep and cattle, along with chickens, guineas, a miniature donkey, three dogs and two cats. Family is at the heart of her life, and she and her husband have four adult children as well as four grandchildren with another on the way.\n\nRAWZ is also thrilled to welcome Teresa Rubio as its new West Coast Territory Manager. Teresa was first introduced to the pet nutrition world after working at IB Pet, an independent pet store in San Diego, where she helped countless pet parents find the right solutions for their companions over the course of eight years. She is passionate about supporting retailers and helping pet parents discover the benefits of RAWZ’s recipes.\n\nAt home, Teresa stays busy with her rescue dog, Appa, and her sweet yet sassy cat, Doechii. She and her husband, PJ, love spending time outdoors fishing or walking along the beach. Now, the couple is preparing for their biggest adventure yet: welcoming their baby girl this December.\n\n“We are thrilled to welcome Annette and Teresa to the RAWZ family,” commented Janet Scott, Owner of RAWZ Natural Pet Food. “They each bring unique experience and a true dedication to helping independent retailers succeed, which will be invaluable as we continue to share our products and mission with more pet parents across the country.”\n\nRAWZ remains committed to its mission of delivering the highest-quality nutrition for pets while donating 100% of profits (after taxes and reserves) to cat and dog rescues, providing service dogs, and supporting spinal cord injury and traumatic brain injury causes. With Annette and Teresa on board, the company is well-positioned to further that mission and strengthen relationships throughout the pet community.\n\nAbout RAWZ Natural Pet Food\n\nRAWZ is a third-generation, family-owned business dedicated to improving the lives of pets through minimally processed nutritionally exceptional recipes. We believe in the meaningful impact pets have on our lives, which is why we created The RAWZ Fund®. Through this initiative, we donate 100% of our profits (after taxes and reserves) to four main causes: cat and dog rescues, providing service dogs, and supporting spinal cord injury and traumatic brain injury causes. To date, we’ve donated over $3.725 million to initiatives that support these causes, reaffirming our commitment to positively impacting the lives of pets, people, and communities. To learn more, please visit www.RAWZNaturalPetFood.com .",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 3
  },
  {
    "title": "Van Den Bosch Partners With Palz&Co. to Bring Single-Ingredient Treats to Retailers",
    "description": "The California-based pet company, specializes in natural single-ingredient treats, collagen chews, and innovative feeding solutions.",
    "url": "https://petsplusmag.com/van-den-bosch-partners-with-palzco-to-bring-single-ingredient-treats-to-retailers/",
    "date": "2025-10-15T20:16:57+00:00",
    "source_section": "Pets+ Magazine (Press Releases)",
    "sponsors": [],
    "_feed_full_text": "(PRESS RELEASE) HOLLAND, MI — John A. Van Den Bosch announced the launch of Palz&Co. Palz&Co., a California-based pet company, specializes in natural single-ingredient treats, collagen chews, and innovative feeding solutions. This partnership will expand retailer access to Palz&Co.’s fast-growing portfolio, including ovenbaked single-ingredient treats in unique proteins such as fish, rabbit, lamb, turkey, beef, and pork, plus new proteins launching soon, including octopus, squid, and eel. Along with its functional accessories like horizontal feeding inserts and snuffle mats.\n\n“At Palz&Co., we’re commi ed to crea ng A Total Pet Experience through natural nutri on and smart solu ons that support both pets and retailers,” said Viral Sura , Director of Sales at Palz&Co. “Working with Van Den Bosch ensures our diverse product lineup reaches more stores and families, delivering health, innova on, and value across the region.” This collabora on combines Palz&Co.’s innova on and variety with Van Den Bosch’s established distribu on network, giving independent retailers new opportuni es to grow with products that stand out in today’s compe ve pet market.\n\n“Adding Palz&Co. to Van Den Bosch will help expand our single ingredient treat offerings greatly! These highquality treats are great for pets with specific allergies and for owners that want to know the details of what is exactly in their pet’s treats. Let’s also not forget about their slow feeding accessories, from silicone mats and snuffle mats, to slow feeder inserts they have a something to fit every dog’s needs,” stated Abby Siebern, VP of Sales & Purchasing at John A. Van Den Bosch. Palz&Co. products are available now to John A. Van Den Bosch customers on our website and in the October Flyer.\n\nAbout John A. Van Den Bosch LLC\n\nJohn A. Van Den Bosch is a trusted name in the pet food products distribution industry and manufacturer of Nature’s Window wild bird seed, known for its high-quality offerings and reliable services. With a rich history of serving retailers, John A. Van Den Bosch has earned a reputation for excellence and professionalism. vboschhome.com\n\nAbout Palz&Co\n\nFounded with a passion for providing affordable, high-quality, all-natural pet treats, as well as slow feeding accessories, Palz&Co has become a trusted leader in the pet supply industry. Their journey began with a vision to offer healthy alternatives that pet owners can rely on, and this commitment has propelled them to continually innovate and exceed industry standards. palzandco.com",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 3
  },
  {
    "title": "Fresh-Food Focused Natural Hounds Launches Nationwide Franchising Opportunities",
    "description": "Fransmart backs the pet brand poised to disrupt the pet industry.",
    "url": "https://petsplusmag.com/fresh-food-focused-natural-hounds-launches-nationwide-franchising-opportunities/",
    "date": "2025-10-15T20:07:48+00:00",
    "source_section": "Pets+ Magazine (Press Releases)",
    "sponsors": [],
    "_feed_full_text": "(PRESS RELEASE) LONG ISLAND, N.Y. — Natural Hounds , the first franchise brand to produce fresh, locally made dog food, has joined forces with Fransmart, the global leader in franchise development, to bring new franchise opportunities to markets nationwide.\n\nNatural Hounds is shaking up the $100+ billion pet industry with a clean, simple, and scalable model designed for franchise growth. Unlike traditional pet concepts that often require complex operations, high staffing, or messy services like grooming and boarding, Natural Hounds operates with a low-overhead model focused on fresh food that helps dogs live longer, healthier lives.\n\nDan Rowe, CEO of Fransmart — the franchise developer behind brands like Five Guys, The Halal Guys, and QDOBA — sees Natural Hounds as the next big player in the booming pet sector.\n\n“Natural Hounds is doing for the pet industry what Five Guys did for burgers,” said Rowe. “They’re taking something people already love, making it better, fresher, and more local — all while delivering one of the easiest operational models I’ve seen. This is a brand built to scale fast and last long.”\n\nFinancial performance for the company’s two Long Island, New York corporate locations, as disclosed in Item 19 of the Natural Hounds Franchise Disclosure Document*, is summarized below:\n\nNatural Hounds offers one of the lowest-cost entry points in the pet franchise sector, with an initial franchise fee of $30,000. The brand also features one of the lowest royalty fees in the Fransmart portfolio—just 4%—for the first few franchisees who join the system, offering early adopters a rare opportunity.\n\n“We saw a massive opportunity to simplify what it means to run a pet business,” said Rick Orlandi, Co-Founder of Natural Hounds. “Our model eliminates the headaches — no grooming, no cleaning, no caretaking — and focuses on what really matters: serving fresh, local food that dogs love and owners trust.”\n\n“Farmer’s Dog and other national brands have spent millions educating the public on the benefits of fresh food,” added Conor Wooley, Co-Founder of Natural Hounds. ” Natural Hounds takes that awareness and builds something local and lasting — a franchise system that turns national demand into neighborhood loyalty.”\n\nWith corporate stores established in Long Island, New York, Natural Hounds is now accepting franchise inquiries and expects early deals to move quickly throughout the East Coast. The company plans to expand into the top 50 U.S. markets, targeting both passionate pet lovers and experienced multi-unit operators seeking an untapped category with strong margins and purpose-driven growth.\n\nFor more information about Natural Hounds and its premium, all-natural pet nutrition solutions, visit www.naturalhounds.com . For more information on becoming a Natural Hounds franchisee, please visit www.fransmart.com/natural-hounds .\n\n*The numbers illustrate the Net Sales and Adjusted Unit Level EBITDA generated by the company-operated stores during the Applicable Measurement Period (From July 1, 2024, to June 30, 2025), as stated in Item 19 of Natural Hound’s Franchise Disclosure Document issued August 22, 2025. “Net Sales” means the total revenues of the business, excluding taxes, discounts, and refunds. “Adjusted Unit Level EBITDA (After Franchise Fees/Costs)” is equal to Gross Profit subtracted by Total Expenses and Franchise Related Costs/Fees Not Incurred by Affiliate. This information is not intended as an offer to sell or the solicitation of an offer to buy a franchise. It is for information purposes only. The offering is by FDD only. Currently, the following states regulate the offer and sale of franchises: California, Hawaii, Illinois, Indiana, Maryland, Michigan, Minnesota, New York, North Dakota, Oregon, Rhode Island, South Carolina (S.S. Reg. No. 1444), South Dakota, Virginia, Washington, and Wisconsin. If you are a resident of or want to locate a franchise in one of these states, we will not offer you a franchise unless and until we have complied with applicable pre-sale registration and disclosure requirements in your state. THIS ADVERTISEMENT IS NOT AN OFFERING. AN OFFERING CAN ONLY BE MADE BY A FRANCHISE DISCLOSURE DOCUMENT FILED WITH THE DEPARTMENT OF THE STATE OF NEW YORK. SUCH FILING DOES NOT CONSTITUTE APPROVAL BY THE DEPARTMENT OF LAW OF THE STATE OF NEW YORK.\n\nAbout Natural Hounds\n\nNatural Hounds is transforming pet nutrition as America’s first fresh, all-natural dog food kitchen franchise. Frustrated by the substandard options in the pet food industry—marked by recalls, by-products, low-quality ingredients, and questionable manufacturing practices—we took matters into our own hands. Setting a new standard for pet nutrition, we produce human-grade dog food, treats, and chews, all crafted in our open-concept storefronts. Established in 2018 at the Port Jefferson Farmer’s Market on Long Island, we began with a simple mission: to provide a trustworthy, all-natural alternative for dog owners. Today, Natural Hounds has grown into a community cornerstone, offering a centralized hub for all canine nutritional needs. Our commitment to honesty, quality, and value is what sets us apart—no other brand does it like Natural Hounds.\n\nAbout Fransmart\n\nAs the leading franchise development firm in the country, Fransmart turns emerging restaurant concepts into successful national and global brands. Founded by Dan Rowe, the man who identified and grew brands such as Five Guys Burgers & Fries and QDOBA Mexican Grill from single unit businesses to the powerhouse chains they are today. Fransmart’s current and past franchise development portfolio brands have opened more than 5,000 restaurants worldwide. For more information, visit  www.fransmart.com .",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 3
  },
  {
    "title": "Hill’s Pet Nutrition Promotes Rauf Gurbuz to U.S. President and General Manager",
    "description": "Gurbuz succeeds Yvonne Hsu, who was recently named President of Hill’s Pet Nutrition.",
    "url": "https://petsplusmag.com/hills-pet-nutrition-promotes-rauf-gurbuz-to-u-s-president-and-general-manager/",
    "date": "2025-10-15T19:30:29+00:00",
    "source_section": "Pets+ Magazine (Press Releases)",
    "sponsors": [],
    "_feed_full_text": "(PRESS RELEASE) OVERLAND PARK, KS — Hill’s Pet Nutrition (Hill’s), a division of Colgate-Palmolive (CP) and a global leader in science-led pet nutrition, announced the promotion of Rauf Gurbuz to U.S. President and General Manager, effective Oct. 15. Gurbuz succeeds Yvonne Hsu, who was recently named President of Hill’s Pet Nutrition.\n\n“We are delighted to welcome Rauf Gurbuz to Hill’s Pet Nutrition,” said Hsu. “His understanding of diverse markets and ability to drive growth will be invaluable as we continue our mission to transform the lives of pets and their families through science-led nutrition and innovation.”\n\nGurbuz will lead the Hill’s U.S. business, championing the company’s strategic vision for growth and innovation. He will focus on accelerating Hill’s leadership position across both the wellness and therapeutic pet food categories by driving new, science-based nutrition tailored to evolving pet needs. Rauf will also prioritize strengthening Hill’s long-term support for the veterinary profession, ensuring practitioners have the resources and latest data to fully harness the power of nutrition in optimizing pet health outcomes.\n\nGurbuz brings more than 20 years of experience within Colgate-Palmolive, most recently serving as Senior Vice President and General Manager, Greater Indochina Hub, Asia Pacific Division. Under his leadership, the team successfully executed a commercial transformation, revitalizing organic sales and market share growth across various markets and categories.\n\nGurbuz began his career with CP-Turkiye in 2004 and built a distinguished track record through a series of roles and categories in general management and customer development. During his tenure, he spearheaded global initiatives for sustainable profitability, leading teams to record sales, profit and market share.\n\n“I am honored and energized to lead the Hill’s U.S. team,” said Gurbuz. “My career at Colgate-Palmolive has been defined by a passion for building brands that make a tangible impact, and I am excited to bring that dedication to Hill’s and our powerful mission to help enrich and lengthen the special relationships between people and their pets. I look forward to working with our dedicated teams to strengthen our leadership position and shape the future of pet nutrition.”\n\nGurbuz holds a Bachelor of Science degree in mechanical engineering from Boğaziçi University in Istanbul.\n\nAbout Hill’s Pet Nutrition\n\nFounded more than 75 years ago with an unwavering commitment to science-led pet nutrition, Hill’s Pet Nutrition is on a mission to help enrich and lengthen the special relationships between people and their pets. Hill’s is dedicated to pioneering research for dogs and cats using a scientific understanding of their specific needs. As a leading veterinarian recommended pet food brand, knowledge is our first ingredient with nearly 200 veterinarians, PhD nutritionists and food scientists working to develop breakthrough innovations in pet health. Hill’s Prescription Diet therapeutic nutrition plus our everyday wellness product line, Hill’s Science Diet, are sold at vet clinics and pet specialty retailers worldwide. For more information about our products and nutritional philosophy, visit HillsPet.com .",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 4
  },
  {
    "title": "Nulo Welcomes World-Class Winter Athletes in Next Chapter of ‘Fuel Incredible’ Campaign",
    "description": "Olympic Gold Medalist ice dancers Madison Chock and Evan Bates are among the stars.",
    "url": "https://petsplusmag.com/nulo-welcomes-world-class-winter-athletes-in-next-chapter-of-fuel-incredible-campaign/",
    "date": "2025-10-14T17:58:04+00:00",
    "source_section": "Pets+ Magazine (Press Releases)",
    "sponsors": [],
    "_feed_full_text": "(PRESS RELEASE) AUSTIN, TX — Nulo , the premium pet food brand dedicated to helping fuel healthier, happier lives, announced the next chapter of its award-winning “Fuel Incredible” campaign, unveiling an inspiring roster of USA winter athletes and their beloved pets. The latest partnerships celebrate resilience, passion, and the unique bond between some of the world’s top athletes and their pets as they prepare to compete on the global stage.\n\nThe lineup of Nulo partners and their four-legged companions includes:\n\nMadison Chock & Evan Bates – Olympic Gold Medalists and 3x World Champions, Ice Dancers\n\nPets: Stella (age 13) & Henry (9), Toy Poodles\n\nAlex Ferreira – 2x Olympic Medalist, Halfpipe Freeskier\n\nPet: Brandy (4), Mixed Breed\n\nBrenna Huckaby – 3x Paralympic Gold Medalist Snowboarder\n\nPet: Mouse (1.5), Cornish Rex\n\nMaddie Mastro – Olympic Halfpipe Snowboarder\n\nPet: Pippy (3), Chihuahua-Pomeranian Mix\n\nKristen Santos-Griswold – Olympian & World Champion Short Track Speed Skater\n\nPets: Bear (13) & Koda (7), Siberian Huskies\n\nJordan Stolz – World Champion Speed Skater\n\nPet: Mitzi (9), Mixed Breed\n\n“I’m thrilled to join the Nulo family as an ambassador,” Huckaby said. “As a Paralympic gold medalist, mom and advocate for living life without limits, I’ve built my platform on the belief that what we put into our bodies fuels what we can achieve. That extends to my family — including our cat, Mouse, who’s just as much a part of the team. Nulo’s commitment to quality nutrition and care mirrors my own values, and I’m excited to share our journey together with my community.”\n\nEach competitor embodies the strength and determination that Nulo champions through its mission to fuel what matters most, whether on the podium, on the slopes or at home with our pets.\n\nThis next chapter of Nulo “Fuel Incredible” builds on the campaign’s successful debut in concert with the competition in Paris, led by Simone Biles, who now passes the torch to winter athletes preparing for the highest level of global competition in their sports.\n\n“Being part of the Nulo family and this campaign has always been special to me because it celebrates athletes not only for what we achieve in competition, but also for who we are and what drives us,” Biles said. “I’m excited to welcome this incredible group of athletes and shine a light on the passion and dedication they bring to their sports, as well as the special relationships they have with their pets.”\n\nThe campaign features a mix of digital media, print and television ads. The cornerstone is a 30-second television spot that will appear on the networks of NBCUniversal in select markets and nationally on Peacock, showcasing Nulo’s team of athlete ambassadors and their pets. Complementing the broadcast push, the broader campaign will come to life through out-of-home activations and in-store retail experiences designed to engage consumers at multiple touchpoints. This continuation follows the first iteration of Fuel Incredible, which was honored by the Digiday Streaming & Video Awards, the MarCom Awards and Cynopsis Sports Media Awards for its compelling narrative and measurable impact, setting the stage for even greater resonance in this next chapter.\n\n“Simone and our initial Fuel Incredible roster, including Olympic gold medalists Caeleb Dressel and Gabby Thomas, set the tone for what this campaign truly represents: authentic stories of perseverance, joy and emotional connection,” said Michael Landa, Nulo Founder and CEO. “This new roster carries that vision forward in a way that reflects Nulo’s mission. We’re proud to share their journeys and deepen our support for athletes and the pets who support them, both through these partnerships.”\n\nThe new “Fuel Incredible” creative begins rolling out starting this week and will continue through 2026, showcasing athlete stories both on and off the ice and snow. For more on Nulo athletes and their pets, visit nulo.com/be-inspired or follow their journeys to Milan-Cortina on Instagram .\n\nAbout Nulo\n\nNulo is on a mission to fuel the inner athlete in every pet. With a wide range of ultra-premium food formats available in more than 6,500 pet specialty retailers nationwide, Nulo ensures pets enjoy the best in digestive and immune health, skin and coat care, mobility, and weight management. Recognized as one of Forbes Magazine’s “Most Innovative Brands at Retail,” Nulo’s offerings are rich in animal-based proteins and low in carbs, crafted to keep pets thriving alongside their human companions. Founded in 2009 and headquartered in Austin, TX, Nulo continues to inspire pet parents and athletes alike. For more information, visit www.nulo.com .",
    "_skip_crawl": true,
    "relevant": false,
    "relevance_score": 2
  },
  {
    "title": "Pet Sitters International Releases First Global Standards for Professional Pet Sitting and Dog Walking",
    "description": "The industry-leading association sets baseline best practices to elevate professionalism and pet-care standards worldwide.",
    "url": "https://petsplusmag.com/pet-sitters-international-releases-first-global-standards-for-professional-pet-sitting-and-dog-walking/",
    "date": "2025-10-14T17:31:58+00:00",
    "source_section": "Pets+ Magazine (Press Releases)",
    "sponsors": [],
    "_feed_full_text": "(PRESS RELEASE) KING, N.C. — Pet Sitters International (PSI), the world’s leading educational organization for professional pet sitters and dog walkers since 1994, has released the first publicly available Global Standards for Professional Pet-Sitting and Dog-Walking Businesses.\n\nDeveloped from PSI’s Recommended Quality Standards for Excellence originally established for PSI members by PSI Founder and CEO Patti J. Moran and her team, the updated framework establishes baseline best practices for pet-care businesses worldwide. Moran and her team have more than 120 years of combined industry experience.\n\nPSI’s Global Standards were reviewed by leaders in the pet care, insurance, and pet health and safety fields, along with a pet owner panel, ensuring they reflect both professional expertise and consumer expectations.\n\n“Since its inception PSI has asked member businesses to commit to standards for excellence in pet sitting and provided them with the resources to meet those standards,” explained PSI President Beth Stultz-Hairston. “Because the pet-sitting industry is rapidly growing but still largely unregulated, we knew it was more important than ever to share our association’s professional industry standards framework with pet-care professionals and pet owners.”\n\nPSI’s Global Standards outline best practices in business legitimacy; contracts and compliance; insurance and risk management; animal care and stewardship; health, sanitation and safety; emergency preparedness; client security and privacy; professional and ethical conduct; client communications and reputation; and sustainability and community responsibility.\n\n“For more than three decades, PSI has pioneered the professional pet-sitting industry,” Moran said. “By releasing these standards publicly, we reaffirm our commitment to shaping the future of our profession and supporting pet-care businesses worldwide with the tools they need to succeed.”\n\nIn the coming year, PSI will release additional resources and training programs to help pet-care business owners adopt and communicate these standards to clients and staff.\n\nThe standards are available for download at www.petsit.com/standards . To learn more about PSI, visit www.petsit.com .\n\nAbout Pet Sitters International\n\nFounded in 1994 by Patti J. Moran , author of Pet Sitting for Profit, Pet Sitters International (PSI) is the world’s largest educational association for professional pet sitters, with member pet-sitting businesses in the United States, Canada and more than 15 other countries. PSI members have access to the widest array of business services and educational resources available in the professional pet-sitting industry. PSI’s Pet Sitter Locator is the largest online directory of professional pet sitters, and pet owners can visit petsit.com/locate to find local professional pet sitters.",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 3
  },
  {
    "title": "Freshpet Partners With Pet Food Experts to Expand Access to Products",
    "description": "The partnership will bring the refrigerated food for dogs and cats to select retailers across all PFX regions.",
    "url": "https://petsplusmag.com/freshpet-partners-with-pet-food-experts-to-expand-access-to-products/",
    "date": "2025-10-14T17:11:16+00:00",
    "source_section": "Pets+ Magazine (Press Releases)",
    "sponsors": [],
    "_feed_full_text": "(PRESS RELEASE) PAWTUCKET, RI — Pet specialty retailers looking to meet growing demand for fresh, nutritious pet food will soon have access to one of the category’s most recognized names: Freshpet .\n\nPet Food Experts (PFX) announced a new partnership with Freshpet that brings their refrigerated food for dogs and cats to select retailers across all PFX regions.\n\nFreshpet products will be stocked in all PFX warehouses, but purchasing access will be limited to approved retailers in alignment with Freshpet’s merchandising and storage standards. This ensures every retailer is set up for success while maintaining Freshpet’s commitment to product integrity and proper refrigeration.\n\n“Freshpet is proud to partner with Pet Food Experts to strengthen our presence in the pet specialty channel,” said Brian Stoeckle, Vice President, Pet Channel at Freshpet. “Together, we’re ensuring pets across the country have access to fresh, real food, while supporting the local retailers that pet parents trust most.”\n\nRollout of Freshpet products has already begun, but retailers must be approved by Freshpet and have the proper refrigeration units in place. Pet Food Experts is working closely with the Freshpet team to support this launch through targeted training and guidance for sales and customer care teams.\n\n“We’re thrilled to add Freshpet to our portfolio,” said Nate Benner, Director of Category Management at Pet Food Experts. “As a brand that leads in quality and innovation, Freshpet is a perfect match for the forward-thinking pet specialty retailers we serve. We’re excited to help our partners differentiate their assortments with a product pet parents are actively seeking.”\n\nRetailers interested in offering Freshpet should connect with their PFX rep to confirm eligibility and learn more about onboarding.\n\nAbout Freshpet\n\nFreshpet’s mission is to elevate the way we feed our pets with fresh food that nourishes all. Freshpet foods are blends of fresh meats, vegetables and fruits farmed locally and made at our Freshpet Kitchens. We thoughtfully prepare our foods using natural ingredients, cooking them in small batches at lower temperatures to preserve the natural goodness of the ingredients. Freshpet foods and treats are kept refrigerated from the moment they are made until they arrive at Freshpet Fridges in your local market.\n\nFrom the care we take to source our ingredients and make our food, to the moment it reaches your home, our integrity, transparency and social responsibility are the way we like to run our business. To learn more, visit www.freshpet.com .\n\nConnect with Freshpet:\n\nhttps://www.facebook.com/Freshpet\n\nhttps://x.com/Freshpet\n\nhttp://instagram.com/Freshpet\n\nhttp://pinterest.com/Freshpet\n\nhttps://www.tiktok.com/@Freshpet\n\nhttps://www.youtube.com/user/freshpet400\n\nAbout Pet Food Experts\n\nPet Food Experts is the #1 pet specialty distributor in the U.S., proudly serving over 10,000 pet retail locations nationwide. With decades of experience, we’re not just a distributor — we’re a trusted partner, driving innovation and building meaningful relationships. Our industry-leading logistics network, which includes the largest cold-chain service in the industry, powers fresh and frozen deliveries to pet superstores, regional chains, farm & feed stores, independent pet shops, and 3PL direct-to-consumer and veterinary clinic channels. We are dedicated to nurturing a healthy, vibrant pet ecosystem that supports the well-being of pets and the communities they call home.",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 4
  },
  {
    "title": "Uproot Clean to Launch in All Pet Supermarket Stores",
    "description": "The partnership reflects growing retailer recognition of Uproot Clean and the pet-hair management category.",
    "url": "https://petsplusmag.com/uproot-clean-to-launch-in-all-pet-supermarket-stores/",
    "date": "2025-10-13T17:37:17+00:00",
    "source_section": "Pets+ Magazine (Press Releases)",
    "sponsors": [],
    "_feed_full_text": "(PRESS RELEASE) DORAL, FL — Uproot Clean , a multiple award-winning leader in innovative pet hair removal solutions, announced a new retail partnership with Pet Supermarket, one of the most trusted names in the pet specialty retail space. Beginning in late October, Uproot Clean’s #1 best-selling product, the Uproot Cleaner Pro, will be available in all 200+ Pet Supermarket locations across Florida.\n\nThis exciting partnership marks a major milestone for Uproot Clean, as it expands its retail footprint in its home state. Known for its high-performance tools that tackle pet hair on furniture, carpets, clothing, and cars, Uproot Clean continues to transform the way pet owners manage life with furry friends.\n\n“We are really thrilled about this partnership,” said Dan Fallak, Management Consultant for Uproot Clean. “Pet Supermarket putting Uproot Clean in all PSM locations means that our customers can now find our most popular product right here in our backyard in Florida at a Pet Supermarket closest to them.”\n\nAs part of the retail launch strategy, Florida residents can expect to see a dedicated social media campaign highlighting the arrival of Uproot Clean products at nearby Pet Supermarket stores. Customers will also be able to find their closest Pet Supermarket location featuring Uproot Clean products using the Uproot Clean Store Locator .\n\n“The Uproot Cleaner Pro is a natural fit for our stores and a great addition to our product lineup. We’re excited to offer this easy, effective, and innovative solution to help pet parents keep their homes clean and enjoy more quality time with their furry companions.” – Harry Freed, Chief Merchandising and Supply Chain Officer\n\nThe addition of Uproot Clean to Pet Supermarket shelves represents another significant step in Uproot Clean’s retail expansion strategy and furthers its mission to become a household name that consumers seek out for all their pet hair clean-up needs.\n\nUproot Clean’s presence in every Pet Supermarket location provides greater convenience for pet owners across Florida who are looking for effective, eco-friendly, and easy-to-use pet hair removal tools trusted by millions of customers.\n\nFor more information or to request wholesale details, visit www.uprootclean.com/wholesale or contact wholesale@uprootclean.com .\n\nAbout Uproot Clean\n\nUproot Clean is an award-winning home and pet care brand dedicated to making life with pets easier and cleaner. Known for its viral, best-selling Uproot Cleaner Pro, the company has helped millions of pet owners eliminate unwanted pet hair from every surface. Uproot Clean’s mission is to simplify pet care with smart, effective, and sustainable solutions that work. Visit www.uprootclean.com to learn more.\n\nAbout Pet Supermarket\n\nPet Supermarket is a one-stop shop offering a broad selection of premium pet food, supplies and services sold by trained professional staff who provide knowledgeable and friendly assistance.Pet Supermarket has over 200 locations equipped to provide pet parents with the convenience to shop locally in a community-oriented and welcoming environment. In addition, Pet Supermarket’s robust e-commerce experience includes standard and same-day delivery nationwide. To learn more about Pet Supermarket, visit PetSupermarket.com .",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 3
  },
  {
    "title": "Zesty Paws Expands Into Feline Wellbeing With Calming Cat Diffuser",
    "description": "Combining vet-formulated expertise with patent-pending nebulizing technology, the diffuser helps cats feel calm and secure.",
    "url": "https://petsplusmag.com/zesty-paws-expands-into-feline-wellbeing-with-calming-cat-diffuser/",
    "date": "2025-10-13T17:30:15+00:00",
    "source_section": "Pets+ Magazine (Press Releases)",
    "sponsors": [],
    "_feed_full_text": "(PRESS RELEASE) ORLANDO, FL — Zesty Paws is entering the feline wellbeing space with the launch of its first calming diffuser for cats. Featuring patent-pending nebulizing technology, this breakthrough innovation marks a significant step forward for the brand in bringing science-led solutions to pets and their parents. In partnership with Petco, a premier name in the pet retail industry, the brand will launch the diffuser nationwide in over 1,300 stores and on Petco.com.\n\nExpertly formulated with veterinarians, the new Zesty Paws Calming Diffuser is designed to gently release pheromones that mimic cats’ natural signals, creating a soothing environment that helps reduce stress-driven behaviors such as scratching, spraying, and over-grooming. Utilizing smart mist technology, the diffuser covers up to 1,000 square feet* for optimal dispersion anywhere in your home. The relaxing orchid scent provides a subtle cue that the diffuser is working, while the natural, drug-free formula safely emits the mist without heat.\n\nPheromones are scents that animals use to communicate with each other within species. They are released by animals through different specialized glands in the body. Pheromones can be sent by cats by rubbing their heads on objects around the house, scratching or clawing at items, urine spraying to mark areas and bumping heads. The Zesty Paws Calming Diffuser mimics the feline facial pheromone (F3) to help cats feel secure, safe, and soothed at home.\n\n“We’re thrilled to introduce our very first cat pheromone diffuser – a science-backed innovation designed to help cats feel calm, safe, and truly at ease in their home environment. For pet parents, that means more harmony, less stress, and the joy of seeing their cats thrive every day,” says Akash Bedi, CEO for North America at H&H Group (parent company of Zesty Paws). “This launch marks an exciting milestone for Zesty Paws, expanding beyond our award-winning supplement range to bring even more holistic wellbeing solutions to pets and their families.”\n\nFor more information about the Zesty Paws Calming Diffuser, visit here .\n\nAbout Zesty Paws\n\nAt Zesty Paws, we are wellness nerds with a non-stop obsession for pet health – meaning we do the research, sweat the small stuff and skip the junk. The result? Bite-Sized. Pet Science. As an award-winning pet supplement brand beloved by besties and trusted by pet parents, helping pets live a Zestful life is more than just a promise, it’s our science-driven method for everything we do. Zesty Paws is also a member of the National Animal Supplement Council (NASC) and proudly displays the NASC Quality Seal on its products. For more information about Zesty Paws, you can visit ZestyPaws.com or follow along on social media on our Instagram, Facebook, or TikTok.\n\n*Dispersion range may vary based on your home’s size, layout, and airflow conditions.\n\n**Cat Diffuser. In-home usage study with 235 respondents, conducted June 2025.",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 3
  },
  {
    "title": "HelloFresh’s The Pets Table Brings Air-Dried Dog Food to PetSmart Stores Nationwide",
    "description": "The pet food brand expands its retail presence with new availability in select PetSmart stores and online.",
    "url": "https://petsplusmag.com/hellofreshs-the-pets-table-brings-air-dried-dog-food-to-petsmart-stores-nationwide/",
    "date": "2025-10-13T17:22:58+00:00",
    "source_section": "Pets+ Magazine (Press Releases)",
    "sponsors": [],
    "_feed_full_text": "(PRESS RELEASE) NEW YORK — The Pets Table , HelloFresh’s premium direct-to-consumer pet food brand, has announced its debut at PetSmart, the largest specialty pet retailer in North America. This new partnership makes it easier than ever for pet parents to access The Pets Table’s minimally processed air-dried recipes, available now in select stores at PetSmart and online at PetSmart.com .\n\nCrafted with an on-staff Board Certified Vet Nutritionist, The Pets Table’s air-dried meals use whole, recognizable ingredients and a gentle cooking method that locks in both nutrients and flavor. In fact, 85% of customers report that their dogs prefer The Pets Table to their old food.\n\n“Our mission has always been to help dogs live healthier, happier lives through better nutrition,” said Laurent Guillemain, Co-Founder and CEO of The Pets Table. “Partnering with PetSmart allows us to put that mission into action on a larger scale, bringing our products directly to the places pet parents already trust for their pets’ care and wellbeing.”\n\nBeyond its air-dried line, The Pets Table also offers human-grade fresh recipes, delivered frozen via customized subscription plans on PetsTable.com, designed to meet the unique caloric needs of every dog at every life stage.\n\nSince its launch in 2023, The Pets Table has delivered more than 20 million meals nationwide. The brand’s availability at PetSmart builds on its growing retail footprint, which also includes Amazon.com, Chewy.com and Walmart stores across the country.\n\nTo shop The Pets Table at PetSmart, click here and to learn more about The Pets Table, visit www.thepetstable.com .\n\nAbout The Pets Table\n\nThe Pets Table is a personalized pet food service designed to keep pets healthy and happy—made with real ingredients that humans love. Launched in 2023, the Company prioritizes high-quality, minimally-processed meal options delivered directly to customers’ doors. For more information, visit www.thepetstable.com .\n\nAbout HelloFresh Group\n\nThe HelloFresh Group is a global digital-native CPG company and the world’s leading meal kit provider. The HelloFresh Group consists of eight brands that provide customers with high quality food and recipes for different meal occasions. The Company was founded in Berlin in November 2011 and operates in the USA, the UK, Germany, the Netherlands, Belgium, Luxembourg, Australia, Austria, Switzerland, Canada, New Zealand, Sweden, France, Denmark, Norway, Italy, Ireland and Spain. In Q1 2025 the HelloFresh Group delivered c. 240 million meals globally. HelloFresh SE went public on the Frankfurt Stock Exchange in November 2017 and is currently traded on the MDAX (Mid-Cap German Stock Market Index). For more information, visit www.hellofreshgroup.com .",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 4
  },
  {
    "title": "Project Hive Pet Company Launches Pumpkin Hive Chew Sticks In Large & Extra-Large Sizes",
    "description": "Three new SKUs expand retail opportunities while supporting Project Hive Pet Company’s mission to save the bees.",
    "url": "https://petsplusmag.com/project-hive-pet-company-launches-pumpkin-hive-chew-sticks-in-large-extra-large-sizes/",
    "date": "2025-10-13T16:08:14+00:00",
    "source_section": "Pets+ Magazine (Press Releases)",
    "sponsors": [],
    "_feed_full_text": "(PRESS RELEASE) Project Hive Pet Company announces the newest addition to its Hive Dog Treat lineup: Pumpkin Hive Chew Sticks in Large and XL sizes! These USA-made, vegetarian dental treats feature a nutrient-rich pumpkin center and a ridged exterior designed to help clean teeth and freshen breath—creating a flavorful, functional chew dogs love.\n\nExpanding The Hive Chew Stick Line\n\nSince the debut of Hive Chew Sticks and Chew Treats in 2021, retailers have embraced Project Hive’s unique, vegetarian dog treats that are gentle on digestion, grain-free, and designed to promote better oral hygiene. The Hive Chew Stick’s compatibility with the Hive Chew Toy offers added enrichment value — providing long lasting engagement and helping relieve boredom.\n\nNow, Project Hive is expanding the line with three new SKUs, featuring one of the fastest-growing flavor trends in the pet industry: pumpkin.\n\nWhy Pumpkin?\n\nPumpkin is a year-round favorite and a powerhouse ingredient known to support healthy digestion. These new treats feature a co-extruded pumpkin center and a lightly crunchy, ridged exterior that helps mechanically clean teeth while offering a mix of flavors and textures dogs can’t resist. With a touch of cinnamon for an appealing aroma, these treats smell as good as they taste—and pet parents appreciate that!\n\nThe New SKUs\n\nPumpkin Hive Chew Sticks – Large (7 oz) – MSRP $11.99\n\nPumpkin Hive Chew Sticks – XL (18.3 oz) – MSRP $18.99\n\nPumpkin Hive Chew Stick – XL Single (3.7 oz) – MSRP $4.99\n\nThe XL size is perfect for larger breeds and available both in a stand-up pouch and individually wrapped singles—ideal for impulse and trial merchandising.\n\nKey Product Benefits\n\nHealthy Teeth & Gums : Ridged exterior helps clean teeth and freshen breath.\n\nPumpkin Power : Nutrient-rich, high-fiber center supports healthy digestion.\n\nVegetarian & Grain-Free : Gentle on dogs’ tummies and great for healthconscious pet parents.\n\nEnrichment Made Easy : Fits snugly into the Hive Chew Toy (L) for longer playtime.\n\nPurchase with Purpose : 1% of every sale funds wildflower habitat to help save the bees.\n\nMade in the USA : Wholesome ingredients and dependable quality.\n\nRetail Opportunities\n\nPumpkin Hive Chew Sticks open new retail opportunities to drive incremental sales:\n\nMerchandise in dental care, functional treats, or seasonal displays.\n\nFeature at checkout or grab-and-go areas for trial and impulse purchases.\n\nCross-merchandise with Hive Chew Toys for bundled sales and higher basket value.\n\nAppeal to mission-driven consumers: Every purchase helps plant wildflower habitat through Project Hive’s 1% for the Planet partnership.\n\nWhere To Buy\n\nPumpkin Hive Chew Sticks are available now through Project Hive’s distributor network, wholesale portal ( https://projecthivepetcompany.com/collections/wholesale ), and Faire.com . Retailers can also request samples or place direct orders by contacting info@projecthivepetcompany.com .\n\nMore Than Dog Treats\n\nAs Halloween approaches and pumpkins appear on porches across North America, it’s worth remembering how dependent pumpkins are on bees for pollination. Project Hive Pet Company’s mission goes beyond creating high-quality pet products—it’s about restoring pollinator habitat and protecting biodiversity. A Certified B Corp and member of 1% for the Planet, Project Hive donates 1% of all sales (not profits) to plant wildflowers and create healthy ecosystems for bees.\n\nAbout Project Hive Pet Company\n\nFounded by Jim Schifman and Melissa Rappaport Schifman, Project Hive Pet Company uses business as a force for good. The company’s line of USA-made dog toys and vegetarian dog treats helps dogs stay active and healthy—while every purchase supports habitat for the vital bee populations. Let’s make our planet thrive—one happy dog and countless bees at a time.\n\nFor more information, email info@projecthivepetcompany.com , visit here , or call (612) 584-1205.\n\nFollow Project Hive and subscribe!\n\nInstagram: instagram.com/projecthivepetcompany\n\nLinkedin: linkedin.com/company/project-hive-pet-company\n\nFacebook: Facebook.com/projecthivepetcompany\n\nTik Tok: tiktok.com/@projecthivepetco\n\nYouTube: https://www.youtube.com/@projecthivepetcompany",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 3
  },
  {
    "title": "Pet Food Institute President and CEO Dana Brooks Will Step Down in 2026",
    "description": "Brooks has lead the organization for seven-plus years.",
    "url": "https://petsplusmag.com/pet-food-institute-president-and-ceo-dana-brooks-will-step-down-in-2026/",
    "date": "2025-10-10T19:55:36+00:00",
    "source_section": "Pets+ Magazine (Press Releases)",
    "sponsors": [],
    "_feed_full_text": "(PRESS RELEASE) WASHINGTON D.C. — The Pet Food Institute (PFI) has announced that its President and CEO Dana Brooks will step down next year after leading the organization since 2018. She will remain in her role and fully engaged in PFI’s advocacy and regulatory work for its members as the search for her replacement takes place.\n\nDana Brooks\n\n“As someone who firmly believes in the unconditional love between humans and their pets—the human-animal bond—I am honored to have led this organization for more than seven years, and to have worked alongside my colleagues, who impress me every day,” said Brooks. “I am fortunate to continue my work through April 2026 in guiding PFI and advancing the interests of our members to help cats and dogs live long and healthy lives, even as we plan for the transition to new leadership.”\n\nBrooks has served since 2018 as President and CEO of PFI, which is headquartered in Washington, D.C. and whose members make the vast majority of dog and cat food and treats in the United States. Brooks is a trusted advisor in the pet food industry. She has lived and worked in D.C. for more than 25 years, representing a range of agricultural interests. Before joining PFI, Brooks was the senior director of government relations at Land O’Lakes, Inc., director of government relations for Elanco Animal Health, senior vice president of government relations at the National Milk Producers Federation and director of public policy at the American Farm Bureau Federation.\n\n“We are deeply grateful for Dana’s dedicated service to PFI and the pet food industry. Her leadership has been instrumental to the success of our work,” said Scott Salmon, president at Simmon’s Pet Food and Pet Food Institute Board Chair. “Dana’s impact over the last seven-and-a-half-years is immeasurable, and she will be deeply missed. We wish her all the best as she begins her next chapter.”\n\nBrooks was named a Woman of Influence by Pet Age and to its Power 50 list, which recognizes the pet industry’s most impactful and influential people. She also served on the Board of Pet Partners from 2018 until 2025, and she received the Women in Agribusiness Ambassador Award.\n\nA Board search committee has been established and will work in partnership with an executive search firm to guide the process. Brooks and the PFI Board are committed to ensuring a seamless, stable transition that preserves continuity in leadership and operations, reinforcing the organization’s strong momentum and enduring commitment to ensuring safe, healthy pet food for the dogs and cats in 94 million U.S. households.\n\nAbout Pet Food Institute\n\nEstablished in 1958, PFI is the trade association and the voice of U.S. cat and dog food manufacturers. Our members account for the vast majority of the dog and cat food and treats made in the United States, with more than $51.7 billion in domestic annual dog and cat food and treats sales and annual exports of more than $2.5 billion. PFI membership also includes companies that supply ingredients, equipment, and services to dog and cat food makers. We are all proud to be feeding the dogs and cats in 94 million U.S. households. Visit petfoodinstitute.org to learn more.",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 3
  },
  {
    "title": "Skiptown Unleashes Franchising Opportunity With New Model",
    "description": "The new franchising arm of the business is now available for pup-loving entrepreneurs.",
    "url": "https://petsplusmag.com/skiptown-unleashes-franchising-opportunity-with-new-model/",
    "date": "2025-10-09T18:56:47+00:00",
    "source_section": "Pets+ Magazine (Press Releases)",
    "sponsors": [],
    "_feed_full_text": "(PRESS RELEASE) CHARLOTTE, NC — Skiptown , a first-of-its-kind, tech-enabled pet care facility offering dog daycare, boarding, full-service grooming, and dog walking, has launched franchising to expand its national footprint. Building on a strong foundation of corporate-owned locations in Charlotte, Atlanta, and Denver, the brand now invites entrepreneurs to join its fast-growing, premium concept.\n\nThe timing aligns with industry trends. According to the American Veterinary Medical Association, nearly half of U.S. households have a dog—nearly 90 million in total—making dogs the dominant household pet and fueling demand for specialized care.\n\n“We’re proud to announce that Skiptown is now open for franchising, marking an exciting new chapter in our growth as we expand to meet the rising demand for personalized pet care,” said Mike Rotondo , CEO of Skiptown. “Skiptown brings an unparalleled standard of care in the pet industry, featuring our proprietary technology that enables convenient in-car drop-off and pick-up, as well as easy customization of appointments. Our highly trained team is well-equipped to extend Skiptown’s premium experience to new markets at an affordable cost, putting pups and their people first.”\n\nAs part of its franchise launch, Skiptown is introducing new facility prototypes designed to deliver its signature services in dog daycare, boarding, grooming, and dog walking. The company is initially targeting growth in Colorado, Florida, Georgia, Kansas, Ohio, Tennessee, Texas, North Carolina, and South Carolina.\n\nChief Development Officer Patti Rother , who brings extensive experience in scaling franchise brands, is leading the company’s franchise growth strategy.\n\n“Skiptown has demonstrated strong unit and growth performance and is entering franchising with proven programs and technology that set us apart in the industry,” Rother said. “We’ve already welcomed more than 50,000 dogs in our three corporate locations, and we see a significant opportunity ahead to share the benefits of Skiptown with more pups and their people across the country.”\n\nSkiptown is already seeing strong early interest in its franchising opportunity. The company is set to host its initial Meet the Team Day in Atlanta on October 22, welcoming prospective franchise candidates from multiple states. This response highlights the brand’s building momentum and that their first three locations are a launchpad for further growth.\n\nFor more information on Skiptown, visit here .\n\nTo learn more about franchising opportunities, visit here .\n\nAbout Skiptown\n\nSkiptown is the spot for pups and their people, with corporate locations in Charlotte, NC, Denver, CO, and Atlanta, GA. Each corporate site offers an off-leash indoor and outdoor turfed park for dogs, a full-service bar for humans, dog daycare, overnight boarding, and grooming. Skiptown also provides dog walking at select locations. As the company expands nationally, Skiptown is introducing its pet care only model for future franchise units, focusing on daycare, overnight boarding, full-service grooming, and in-home services such as dog walking, poop pick-up and overnight care. Skiptown delivers convenience, quality, and trust through an expertly trained team and easy-to-use mobile app. To learn more about Skiptown, visit https://skiptown.io . To learn more about franchising opportunities, visit https://skiptown.io/franchising/ .",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 4
  },
  {
    "title": "John A. Van Den Bosch Announces Partnership With The New Zealand Natural Pet Food Co.",
    "description": "The premium pet nutrition company from New Zealand creates freeze-dried and air-dried recipes for dogs and cats.",
    "url": "https://petsplusmag.com/john-a-van-den-bosch-announces-partnership-with-the-new-zealand-natural-pet-food-co/",
    "date": "2025-10-09T18:52:45+00:00",
    "source_section": "Pets+ Magazine (Press Releases)",
    "sponsors": [],
    "_feed_full_text": "(PRESS RELEASE) HOLLAND, MI — John A. Van Den Bosch, recognized for over 90 years of exceptional service and a curated selection of premium products, announces a new partnership with The New Zealand Natural Pet Food Co. The New Zealand Natural Pet Food Co. is a premium pet nutrition company from New Zealand. They create freeze dried and air dried recipes for dogs and cats using free range and grass-fed meats, wild proteins such as Venison and Brushtail, and superfoods like green lipped mussels and manuka honey, all sourced locally.\n\nTheir recipes deliver the nutrition of raw whole food with the convenience of dry, made in small batches with simple, clean ingredients and no fillers. They believe better food leads to healthier, happier pets, and our recipes give pet parents simple ways to add natural New Zealand nutrition to every bowl. “We are excited to partner with Van Den Bosch to expand access to our range for independent pet retailers and their customers. Partnerships like this make all the difference. Van Den Bosch has such strong connections with independent stores, and we love their focus on service and education. Working together means more retailers can confidently bring in natural New Zealand nutrition that pets really enjoy and thrive on,” said Amber Cordero, Co-Founder of The New Zealand Natural Pet Food Co.\n\n“We are thrilled to be welcoming The New Zealand Natural Pet Food Co. to our warehouse. Their premium food and clean ingredient panels fill a niche in a category we were missing. They also stand out from most others in this category by offering a new and unique recipe, wild brushtail. This invasive species in New Zealand is high in protein and a great alternative for pets with chicken or beef allergies. We can’t wait to see this partnership flourish in the coming years!” Stated Abby Siebern, VP of Sales & Purchasing at John A. Van Den Bosch. The New Zealand Natural Pet Food Co. products are available now to John A. Van Den Bosch customers on our website & in our October Flyer.\n\nAbout John A. Van Den Bosch LLC\n\nJohn A. Van Den Bosch is a trusted name in the pet food products distribution industry and manufacturer of Nature’s Window wild bird seed, known for its high-quality offerings and reliable services. With a rich history of serving retailers, John A. Van Den Bosch has earned a reputation for excellence and professionalism. vboschhome.com\n\nAbout The New Zealand Natural Pet Food Co.\n\nThe New Zealand Natural Pet Food Co. creates a premium range of pet food and treats using only the highest quality ingredients aimed at giving your animal what they need to thrive. Nourish your pets from the inside out, naturally. nznaturalpetfood.com",
    "_skip_crawl": true,
    "relevant": true,
    "relevance_score": 4
  },
  {
    "title": "Competition authority recommends overhaul of vet service pricing",
    "description": "Vet practices could be required to publish comprehensive price lists, and to be clear if…",
    "url": "https://www.petbusinessworld.co.uk/trade-news/legislation/competition-authority-recommends-overhaul-of-vet-service-pricing.html",
    "date": "2025-10-15T00:00:00+00:00",
    "source_section": "Pet Business World",
    "sponsors": [],
    "relevant": true,
    "relevance_score": 5
  },
  {
    "title": "Paleo Ridge phases in new packaging",
    "description": "Raw food producer Paleo Ridge is phasing in new packaging for its portfolio of meals,…",
    "url": "https://www.petbusinessworld.co.uk/trade-news/manufacturers/paleo-ridge-phases-in-new-packaging.html",
    "date": "2025-10-13T00:00:00+00:00",
    "source_section": "Pet Business World",
    "sponsors": [],
    "relevant": true,
    "relevance_score": 2
  },
  {
    "title": "New company The PetFellas promises to “redefine” distribution",
    "description": "New distributor The PetFellas has been launched, with the bold promise to “redefine brand-led distribution…",
    "url": "https://www.petbusinessworld.co.uk/trade-news/distributors/new-company-the-petfellas-promises-to-redefine-distribution.html",
    "date": "2025-10-10T00:00:00+00:00",
    "source_section": "Pet Business World",
    "sponsors": [],
    "relevant": true,
    "relevance_score": 4
  },
  {
    "title": "Burgess Pet Care expands into Scandinavia",
    "description": "Yorkshire-based small animal food supplier Burgess Pet Care has strengthened its partnership with Scandinavian distributor…",
    "url": "https://www.petbusinessworld.co.uk/trade-news/manufacturers/burgess-pet-care-expands-into-scandinavia.html",
    "date": "2025-10-10T00:00:00+00:00",
    "source_section": "Pet Business World",
    "sponsors": [],
    "relevant": true,
    "relevance_score": 3
  },
  {
    "title": "Veterinary Industry Leader Dr. Stephen Fisher Joins Anivive Board of Directors",
    "description": "Anivive Lifesciences, a software-driven pet pharmaceutical company, has announced the appointment of Stephen Fisher, DVM, to its board of directors. Dr. Fisher’s appointment marks a pivotal milestone as Anivive transitions […]",
    "url": "https://www.petage.com/veterinary-industry-leader-dr-stephen-fisher-joins-anivive-board-of-directors/",
    "date": "2025-10-15T00:00:00+00:00",
    "source_section": "Pet Age",
    "sponsors": [],
    "relevant": true,
    "relevance_score": 4
  },
  {
    "title": "CityVet Veterinarian-Owned Network to Expand with Leon Springs, Texas Location",
    "description": "CityVet, a growing network of 71 veterinarian-owned practices offering unique programs serving people through pet care with kindness for over 25 years, continues its expansion with the opening of CityVet […]",
    "url": "https://www.petage.com/cityvet-veterinarian-owned-network-to-expand-with-leon-springs-texas-location/",
    "date": "2025-10-15T00:00:00+00:00",
    "source_section": "Pet Age",
    "sponsors": [],
    "relevant": true,
    "relevance_score": 3
  },
  {
    "title": "RAWZ Natural Pet Food Expands Sales Team with New Territory Managers",
    "description": "RAWZ Natural Pet Food, a family-owned company dedicated to providing minimally processed nutrition for dogs and cats while giving back to those in need, has announced the addition of two […]",
    "url": "https://www.petage.com/rawz-natural-pet-food-expands-sales-team-with-new-territory-managers/",
    "date": "2025-10-15T00:00:00+00:00",
    "source_section": "Pet Age",
    "sponsors": [],
    "relevant": true,
    "relevance_score": 3
  },
  {
    "title": "Hill’s Pet Nutrition Promotes Rauf Gurbuz to US President, General Manager",
    "description": "Hill’s Pet Nutrition, a division of Colgate-Palmolive and a global leader in science-led pet nutrition, has announced the promotion of Rauf Gurbuz to U.S. president and general manager, effective October […]",
    "url": "https://www.petage.com/hills-pet-nutrition-promotes-rauf-gurbuz-to-us-president-general-manager/",
    "date": "2025-10-15T00:00:00+00:00",
    "source_section": "Pet Age",
    "sponsors": [],
    "relevant": true,
    "relevance_score": 4
  },
  {
    "title": "Skiptown Unveils Franchising Model, Tapping into Thriving Pet Services Category",
    "description": "Skiptown, a first-of-its-kind, tech-enabled pet care facility offering dog daycare, boarding, full-service grooming, and dog walking, has launched franchising to expand its national footprint. Building on a strong foundation of […]",
    "url": "https://www.petage.com/skiptown-unveils-franchising-model-tapping-into-thriving-pet-services-category/",
    "date": "2025-10-15T00:00:00+00:00",
    "source_section": "Pet Age",
    "sponsors": [],
    "relevant": true,
    "relevance_score": 4
  },
  {
    "title": "Van Den Bosch Partners with Palz&Co. to Bring Single-Ingredient Dog Treats to Pet Retailers",
    "description": "John A. Van Den Bosch recently announced the launch of Palz&Co. Palz&Co., a California-based pet company that specializes in natural single-ingredient treats, collagen chews and innovative feeding solutions. This partnership […]",
    "url": "https://www.petage.com/van-den-bosch-partners-with-palzco-to-bring-single-ingredient-dog-treats-to-pet-retailers/",
    "date": "2025-10-15T00:00:00+00:00",
    "source_section": "Pet Age",
    "sponsors": [],
    "relevant": true,
    "relevance_score": 3
  },
  {
    "title": "Tvati Appoints Dr. Katie Kangas, Dr. Troy Looper to Executive Veterinary Leadership Roles",
    "description": "Tvati, a developer of integrative, plant-based veterinary health solutions, has announced the appointments of two recognized leaders in veterinary medicine to its senior team. Dr. Katie Kangas, DVM, CVA, CVCP, […]",
    "url": "https://www.petage.com/tvati-appoints-dr-katie-kangas-dr-troy-looper-to-executive-veterinary-leadership-roles/",
    "date": "2025-10-15T00:00:00+00:00",
    "source_section": "Pet Age",
    "sponsors": [],
    "relevant": true,
    "relevance_score": 3
  },
  {
    "title": "Petfolk Expands in Kansas City Metro with New Overland Park Veterinary Location",
    "description": "Petfolk, a modern veterinary care company revolutionizing pet health through design, technology and human-centered care, is opening its newest location in Overland Park, Kansas. This latest milestone marks Petfolk’s 35th pet care […]",
    "url": "https://www.petage.com/petfolk-expands-in-kansas-city-metro-with-new-overland-park-veterinary-location/",
    "date": "2025-10-14T00:00:00+00:00",
    "source_section": "Pet Age",
    "sponsors": [],
    "relevant": true,
    "relevance_score": 3
  },
  {
    "title": "Freshpet Partners with Pet Food Experts to Expand Access to Fresh, Refrigerated Pet Food",
    "description": "Pet specialty retailers looking to meet growing demand for fresh, nutritious pet food will soon have access to one of the category’s most recognized names: Freshpet. Pet Food Experts (PFX) has […]",
    "url": "https://www.petage.com/freshpet-partners-with-pet-food-experts-to-expand-access-to-fresh-refrigerated-pet-food/",
    "date": "2025-10-14T00:00:00+00:00",
    "source_section": "Pet Age",
    "sponsors": [],
    "relevant": true,
    "relevance_score": 4
  },
  {
    "title": "Nulo Welcomes World-Class Winter Athletes in Next Chapter of Fuel Incredible Campaign",
    "description": "Nulo, a premium pet food brand dedicated to helping fuel healthier, happier lives, has unveiled the next chapter of its award-winning “Fuel Incredible” campaign, unveiling an inspiring roster of U.S.A. […]",
    "url": "https://www.petage.com/nulo-welcomes-world-class-winter-athletes-in-next-chapter-of-fuel-incredible-campaign/",
    "date": "2025-10-14T00:00:00+00:00",
    "source_section": "Pet Age",
    "sponsors": [],
    "relevant": false,
    "relevance_score": 2
  },
  {
    "title": "The Pets Table Brings Air-Dried Premium Dog Food to PetSmart Customers",
    "description": "The Pets Table, HelloFresh’s premium direct-to-consumer pet food brand, has announced today its debut at PetSmart, the largest specialty pet retailer in North America. This new partnership makes it easier […]",
    "url": "https://www.petage.com/the-pets-table-brings-air-dried-premium-dog-food-to-petsmart-customers/",
    "date": "2025-10-13T00:00:00+00:00",
    "source_section": "Pet Age",
    "sponsors": [],
    "relevant": true,
    "relevance_score": 4
  },
  {
    "title": "Florida-Based Uproot Clean to Launch Pet Hair Management Products in Pet Supermarket",
    "description": "Uproot Clean, an award-winning leader in innovative pet hair removal solutions, has announced a retail partnership with Pet Supermarket, one of the most trusted names in the pet specialty retail […]",
    "url": "https://www.petage.com/florida-based-uproot-clean-to-launch-pet-hair-management-products-in-pet-supermarket/",
    "date": "2025-10-13T00:00:00+00:00",
    "source_section": "Pet Age",
    "sponsors": [],
    "relevant": true,
    "relevance_score": 3
  }
]